[
{"content": {"PART IV": "Information with respect to principal independent registered public accounting firm fees and services is incorporated by reference from the information under the caption “Proposal Two: Ratification of Appointment of Independent Registered Public Accounting Firm” in our Proxy Statement for the Annual Meeting of Stockholders."}, "number": "Item 14", "title": "Principal Accounting Fees and Services"},
{"content": {"Stock Performance Graph": "Market Information"}, "number": "Item 5", "title": "Market for Registrant’s Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities"},
{"content": {"PART II": "Information with respect to this item may be found in "}, "number": "Item 3", "title": "Legal Proceedings "},
{"content": {"PART IV": "Information required by this item is incorporated by reference from information contained under the sections “Security Ownership of Certain Beneficial Owners and Management” and “Equity Compensation Plan Information” in our Proxy Statement for the Annual Meeting of Stockholders."}, "number": "Item 12", "title": "Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters"},
{"content": {"PART II": "Our corporate headquarters are located in Los Gatos, California and consist of leased space aggregating approximately 370,000 square feet. In the third quarter of 2015, the Company entered into additional lease agreements to expand its Los Gatos, California headquarters by approximately 260,000 square feet with a lease term of 10 years commencing after construction of the facilities, which is expected in late 2016."}, "number": "Item 2", "title": "Properties"},
{"content": {"Report of Independent Registered Public Accounting Firm": "The consolidated financial statements and accompanying notes listed in Part IV, Item 15(a)(1) of this Annual Report on Form 10-K are included immediately following Part IV hereof and incorporated by reference herein."}, "number": "Item 8", "title": "Financial Statements and Supplementary Data"},
{"content": {"PART IV": "Information regarding our directors and executive officers is incorporated by reference from the information contained under the sections “Proposal One: Election of Directors,” “Section 16(a) Beneficial Ownership Compliance” and “Code of Ethics” in our Proxy Statement for the Annual Meeting of Stockholders."}, "number": "Item 10", "title": "Directors, Executive Officers and Corporate Governance"},
{"content": {"PART III": "None."}, "number": "Item 9B", "title": "Other Information"},
{"content": {"PART IV": "Information required by this item is incorporated by reference from information contained under the section “Compensation of Executive Officers and Other Matters” in our Proxy Statement for the Annual Meeting of Stockholders."}, "number": "Item 11", "title": "Executive Compensation"},
{"content": {"Report of Independent Registered Public Accounting Firm": "None."}, "number": "Item 9", "title": "Changes in and Disagreements with Accountants on Accounting and Financial Disclosure"},
{"content": {"PART II": "None."}, "number": "Item 1B", "title": "Unresolved Staff Comments"},
{"content": {"Report of Independent Registered Public Accounting Firm": "We are exposed to market risks related to interest rate changes and the corresponding changes in the market values of our investments, debt and foreign currency fluctuations."}, "number": "Item 7A", "title": "Quantitative and Qualitative Disclosures about Market Risk"},
{"content": {"ABOUT US": "Netflix, Inc. (“Netflix”, “the Company”, “we”, or “us”) is the world’s leading Internet television network with over 75 million streaming members in over 190 countries enjoying more than 125 million hours of TV shows and movies per day, including original series, documentaries and feature films.  Our members can watch as much as they want, anytime, anywhere, on nearly any Internet-connected screen.  Members can play, pause and resume watching, all without commercials or commitments.  Additionally, in the United States (\"U.S.\"), our members can receive DVDs delivered quickly to their homes."}, "number": "Item 1", "title": "Business"},
{"content": {"NETFLIX, INC.": "The financial statements are filed as part of this Annual Report on Form 10-K under “Item 8.  Financial Statements and Supplementary Data.”"}, "number": "Item 15", "title": "Exhibits, Financial Statement Schedules"},
{"content": {"Overview and Results of Operations": "The following represents our consolidated performance highlights:"}, "number": "Item 7", "title": "Management’s Discussion and Analysis of Financial Condition and Results of Operations"},
{"content": {"PART IV": "Information required by this item is incorporated by reference from information contained under the section “Certain Relationships and Related Transactions” and “Director Independence” in our Proxy Statement for the Annual Meeting of Stockholders."}, "number": "Item 13", "title": "Certain Relationships and Related Transactions, and Director Independence"},
{"content": {"PART II": "Not applicable."}, "number": "Item 4", "title": "Mine Safety Disclosures"},
{"content": {"Report of Independent Registered Public Accounting Firm": "Our management, with the participation of our Chief Executive Officer and Chief Financial Officer, evaluated the effectiveness of our disclosure controls and procedures (as defined in Rules 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934, as amended) as of the end of the period covered by this Annual Report on Form 10-K.  Based on that evaluation, our Chief Executive Officer and Chief Financial Officer concluded that our disclosure controls and procedures as of the end of the period covered by this Annual Report on Form 10-K were effective in providing reasonable assurance that information required to be disclosed by us in reports that we file or submit under the Securities Exchange Act of 1934, as amended, is recorded, processed, summarized and reported within the time periods specified in the Securities and Exchange Commission’s rules and forms, and that such information is accumulated and communicated to our management, including our Chief Executive Officer and Chief Financial Officer, as appropriate, to allow timely decisions regarding required disclosures."}, "number": "Item 9A", "title": "Controls and Procedures"}
]
