[
{"content": {"11": "Information required by Item 11 of Part III is included in our Proxy Statement relating to our \n Annual Meeting of Shareholders and is incorporated herein by reference. ", "1A": "Please carefully consider the following risk factors. If any of the following risks occur, our business, financial condition, operating results, and cash flows could be materially adversely affected. In addition, the current global economic climate amplifies many of these risks.\nOur businesses are rapidly evolving and intensely competitive, and we have many competitors in different industries, including retail, e-commerce services, digital content and electronic devices, and web and infrastructure computing services. Some of our current and potential competitors have greater resources, longer histories, more customers, and/or greater brand recognition. They may secure better terms from vendors, adopt more aggressive pricing, and devote more resources to technology, infrastructure, fulfillment, and marketing.\nCompetition may intensify as our competitors enter into business combinations or alliances and established companies in other market segments expand to become competitive with our business. In addition, new and enhanced technologies, including search, web and infrastructure computing services, digital content, and electronic devices, may increase our competition. The Internet facilitates competitive entry and comparison shopping, and increased competition may reduce our sales and profits.\nOur Expansion Places a Significant Strain on our Management, Operational, Financial, and Other Resources\nWe are rapidly and significantly expanding our global operations, including increasing our product and service offerings and scaling our infrastructure to support our retail and services businesses. This expansion increases the complexity of our business and places significant strain on our management, personnel, operations, systems, technical performance, financial resources, and internal financial control and reporting functions. We may not be able to manage growth effectively, which could damage our reputation, limit our growth, and negatively affect our operating results.\nOur Expansion into New Products, Services, Technologies, and Geographic Regions Subjects Us to Additional Business, Legal, Financial, and Competitive Risks\nWe may have limited or no experience in our newer market segments, and our customers may not adopt our new offerings. These offerings may present new and difficult technology challenges, and we may be subject to claims if customers of these offerings experience service disruptions or failures or other quality issues. In addition, profitability, if any, in our newer activities may be lower than in our older activities, and we may not be successful enough in these newer activities to recoup our investments in them. If any of this were to occur, it could damage our reputation, limit our growth, and negatively affect our operating results.\nWe May Experience Significant Fluctuations in Our Operating Results and Growth Rate\nWe may not be able to accurately forecast our growth rate. We base our expense levels and investment plans on sales estimates. A significant portion of our expenses and investments is fixed, and we may not be able to adjust our spending quickly enough if our sales are less than expected.\nOur revenue growth may not be sustainable, and our percentage growth rates may decrease. Our revenue and operating profit growth depends on the continued growth of demand for the products and services offered by us or our sellers, and our business is affected by general economic and business conditions worldwide. A softening of demand, whether caused by changes in customer preferences or a weakening of the U.S. or global economies, may result in decreased revenue or growth.\nOur sales and operating results will also fluctuate for many other reasons, including due to risks described elsewhere in this section and the following:\nour ability to retain and increase sales to existing customers, attract new customers, and satisfy our customers’ demands;\nour ability to retain and expand our network of sellers;\nour ability to offer products on favorable terms, manage inventory, and fulfill orders;\nthe introduction of competitive websites, products, services, price decreases, or improvements;\nchanges in usage or adoption rates of the Internet, e-commerce, electronic devices, and web services, including outside the U.S.;\ntiming, effectiveness, and costs of expansion and upgrades of our systems and infrastructure;\nthe success of our geographic, service, and product line expansions;\nthe extent to which we finance, and the terms of any such financing for, our current operations and future growth;\nthe outcomes of legal proceedings and claims, which may include significant monetary damages or injunctive relief and could have a material adverse impact on our operating results;\nvariations in the mix of products and services we sell;\nvariations in our level of merchandise and vendor returns;\nthe extent to which we offer free shipping, continue to reduce prices worldwide, and provide additional benefits to our customers;\nthe extent to which we invest in technology and content, fulfillment, and other expense categories;\nincreases in the prices of fuel and gasoline, as well as increases in the prices of other energy products and commodities like paper and packing supplies;\nthe extent to which our equity-method investees record significant operating and non-operating items;\nthe extent to which operators of the networks between our customers and our websites successfully charge fees to grant our customers unimpaired and unconstrained access to our online services;\nour ability to collect amounts owed to us when they become due;\nthe extent to which use of our services is affected by spyware, viruses, phishing and other spam emails, denial of service attacks, data theft, computer intrusions, outages, and similar events; and\nOur International Operations Expose Us to a Number of Risks\nOur international activities are significant to our revenues and profits, and we plan to further expand internationally. In certain international market segments, we have relatively little operating experience and may not benefit from any first-to-market advantages or otherwise succeed. It is costly to establish, develop, and maintain international operations and websites, and promote our brand internationally. Our international operations may not be profitable on a sustained basis.\nIn addition to risks described elsewhere in this section, our international sales and operations are subject to a number of risks, including:\ngovernment regulation of e-commerce and other services, electronic devices, and competition, and restrictive governmental actions (such as trade protection measures, including export duties and quotas and custom duties and tariffs), nationalization, and restrictions on foreign ownership;\nrestrictions on sales or distribution of certain products or services and uncertainty regarding liability for products, services, and content, including uncertainty as a result of less Internet-friendly legal systems, local laws, lack of legal precedent, and varying rules, regulations, and practices regarding the physical and digital distribution of media products and enforcement of intellectual property rights;\nbusiness licensing or certification requirements, such as for imports, exports, web services, and electronic devices;\nlimitations on the repatriation and investment of funds and foreign currency exchange restrictions;\nshorter payable and longer receivable cycles and the resultant negative impact on cash flow;\nlaws and regulations regarding consumer and data protection, privacy, network security, encryption, payments, and restrictions on pricing or discounts;\nlower levels of consumer spending and fewer opportunities for growth compared to the U.S.;\nlower levels of credit card usage and increased payment risk;\ndifficulty in staffing, developing, and managing foreign operations as a result of distance, language, and cultural differences;\ndifferent employee/employer relationships and the existence of works councils and labor unions;\ncompliance with the U.S. Foreign Corrupt Practices Act and other applicable U.S. and foreign laws prohibiting corrupt payments to government officials and other third parties;\nlaws and policies of the U.S. and other jurisdictions affecting trade, foreign investment, loans, and taxes; and\nAs international e-commerce and other online and web services grow, competition will intensify. Local companies may have a substantial competitive advantage because of their greater understanding of, and focus on, the local customer, as well as their more established local brand names. We may not be able to hire, train, retain, and manage required personnel, which may limit our international growth.\nThe People’s Republic of China (“PRC”) and India regulate Amazon’s and its affiliates’ businesses and operations in country through regulations and license requirements that may restrict (i) foreign investment in and operation of the Internet, IT infrastructure, data centers, retail, delivery, and other sectors, (ii) Internet content, and (iii) the sale of media and other products and services. For example, in order to meet local ownership and regulatory licensing requirements, www.amazon.cn is operated by PRC companies that are indirectly owned, either wholly or partially, by PRC nationals. In addition, we provide certain technology services in China in conjunction with third parties that hold PRC licenses to provide services. In India, the government restricts the ownership or control of Indian companies by foreign entities involved in online multi-brand retail trading activities. For www.amazon.in, we provide certain marketing tools and logistics services to third party sellers to enable them to sell online and deliver to customers, and we hold an indirect minority interest in an entity that is a third-party seller on the www.amazon.in marketplace. Although we believe these structures and activities comply with existing laws, they involve unique risks, and the PRC is actively considering changes in its foreign investment rules that could impact these structures and activities. There are substantial uncertainties regarding the interpretation of PRC and Indian laws and regulations, and it is possible that these governments will ultimately take a view contrary to ours. In addition, our Chinese and Indian businesses and operations may be unable to continue to operate if we or our affiliates are unable to access sufficient funding or in China enforce contractual relationships with respect to management and control of such businesses. If our international activities were found to be in violation of any existing or future PRC, Indian or other laws or regulations or if interpretations of those laws and regulations were to change, our businesses in those countries could be subject to fines and other financial penalties, have licenses revoked, or be forced to shut down entirely. \nIf We Do Not Successfully Optimize and Operate Our Fulfillment Network and Data Centers, Our Business Could Be Harmed\nIf we do not adequately predict customer demand or otherwise optimize and operate our fulfillment network and data centers successfully, it could result in excess or insufficient fulfillment or data center capacity, or result in increased costs, impairment charges, or both, or harm our business in other ways. As we continue to add fulfillment and data center capability or add new businesses with different requirements, our fulfillment and data center networks become increasingly complex and operating them becomes more challenging. There can be no assurance that we will be able to operate our networks effectively.\nIn addition, a failure to optimize inventory in our fulfillment network will increase our net shipping cost by requiring long-zone or partial shipments. Orders from several of our websites are fulfilled primarily from a single location, and we have only a limited ability to reroute orders to third parties for drop-shipping. We and our co-sourcers may be unable to adequately staff our fulfillment network and customer service centers. If the other businesses on whose behalf we perform inventory fulfillment services deliver product to our fulfillment centers in excess of forecasts, we may be unable to secure sufficient storage space and may be unable to optimize our fulfillment network. \nWe rely on a limited number of shipping companies to deliver inventory to us and completed orders to our customers. If we are not able to negotiate acceptable terms with these companies or they experience performance problems or other difficulties, it could negatively impact our operating results and customer experience. In addition, our ability to receive inbound inventory efficiently and ship completed orders to customers also may be negatively affected by inclement weather, fire, flood, power loss, earthquakes, labor disputes, acts of war or terrorism, acts of God, and similar factors.\nThird parties either drop-ship or otherwise fulfill an increasing portion of our customers’ orders, and we are increasingly reliant on the reliability, quality, and future procurement of their services. Under some of our commercial agreements, we maintain the inventory of other companies, thereby increasing the complexity of tracking inventory and operating our fulfillment network. Our failure to properly handle such inventory or the inability of these other companies to accurately forecast product demand would result in unexpected costs and other harm to our business and reputation.\nThe Seasonality of Our Business Places Increased Strain on Our Operations\nWe expect a disproportionate amount of our net sales to occur during our fourth quarter. If we do not stock or restock popular products in sufficient amounts such that we fail to meet customer demand, it could significantly affect our revenue and our future growth. If we overstock products, we may be required to take significant inventory markdowns or write-offs and incur commitment costs, which could reduce profitability. We may experience an increase in our net shipping cost due to complimentary upgrades, split-shipments, and additional long-zone shipments necessary to ensure timely delivery for the holiday season. If too many customers access our websites within a short period of time due to increased holiday demand, we may experience system interruptions that make our websites unavailable or prevent us from efficiently fulfilling orders, which may reduce the volume of goods we sell and the attractiveness of our products and services. In addition, we may be unable to adequately staff our fulfillment network and customer service centers during these peak periods and delivery and other fulfillment companies and customer service co-sourcers may be unable to meet the seasonal demand. We also face risks described elsewhere in this Item 1A relating to fulfillment network optimization and inventory.\nWe generally have payment terms with our retail vendors that extend beyond the amount of time necessary to collect proceeds from our consumer customers. As a result of holiday sales, as of December 31 of each year, our cash, cash equivalents, and marketable securities balances typically reach their highest level (other than as a result of cash flows provided by or used in investing and financing activities). This operating cycle results in a corresponding increase in accounts payable as of December 31. Our accounts payable balance generally declines during the first three months of the year, resulting in a corresponding decline in our cash, cash equivalents, and marketable securities balances.\nOur Business Could Suffer if We Are Unsuccessful in Making, Integrating, and Maintaining Commercial Agreements, Strategic Alliances, and Other Business Relationships\nWe provide e-commerce and other services to businesses through commercial agreements, strategic alliances, and business relationships. Under these agreements, we provide web services, technology, fulfillment, computing, digital storage, and other services, as well as enable sellers to offer products or services through our websites. These arrangements are complex and require substantial infrastructure capacity, personnel, and other resource commitments, which may limit the amount of business we can service. We may not be able to implement, maintain, and develop the components of these commercial relationships, which may include web services, fulfillment, customer service, inventory management, tax collection, payment processing, hardware, content, and third-party software, and engaging third parties to perform services. The amount of compensation we receive under certain of our commercial agreements is partially dependent on the volume of the other company’s sales. Therefore, if the other company’s offering is not successful, the compensation we receive may be lower than expected or the agreement may be terminated. Moreover, we may not be able to enter into additional commercial relationships and strategic alliances on favorable terms. We also may be subject to claims from businesses to which we provide these services if we are unsuccessful in implementing, maintaining, or developing these services.\nAs our agreements terminate, we may be unable to renew or replace these agreements on comparable terms, or at all. We may in the future enter into amendments on less favorable terms or encounter parties that have difficulty meeting their contractual obligations to us, which could adversely affect our operating results.\nOur present and future e-commerce services agreements, other commercial agreements, and strategic alliances create additional risks such as:\ndisruption of our ongoing business, including loss of management focus on existing businesses;\nvariability in revenue and income from entering into, amending, or terminating such agreements or relationships; and\ndifficulty integrating under the commercial agreements.\nOur Business Could Suffer if We Are Unsuccessful in Making, Integrating, and Maintaining Acquisitions and Investments\nWe have acquired and invested in a number of companies, and we may acquire or invest in or enter into joint ventures with additional companies. These transactions create risks such as:\ndisruption of our ongoing business, including loss of management focus on existing businesses;\nadditional operating losses and expenses of the businesses we acquired or in which we invested;\nthe potential impairment of tangible and intangible assets and goodwill, including as a result of acquisitions;\nthe potential impairment of customer and other relationships of the company we acquired or in which we invested or our own customers as a result of any integration of operations;\nthe difficulty of incorporating acquired technology and rights into our offerings and unanticipated expenses related to such integration;\nthe difficulty of integrating a new company’s accounting, financial reporting, management, information and information security, human resource, and other administrative systems to permit effective management, and the lack of control if such integration is delayed or not implemented;\nfor investments in which an investee’s financial performance is incorporated into our financial results, either in full or in part, the dependence on the investee’s accounting, financial reporting, and similar systems, controls, and processes;\nthe difficulty of implementing at companies we acquire the controls, procedures, and policies appropriate for a larger public company;\npotential unknown liabilities associated with a company we acquire or in which we invest; and\nfor foreign transactions, additional risks related to the integration of operations across different cultures and languages, and the economic, political, and regulatory risks associated with specific countries.\nAs a result of future acquisitions or mergers, we might need to issue additional equity securities, spend our cash, or incur debt, contingent liabilities, or amortization expenses related to intangible assets, any of which could reduce our profitability and harm our business. In addition, valuations supporting our acquisitions and strategic investments could change rapidly given the current global economic climate. We could determine that such valuations have experienced impairments or other-than-temporary declines in fair value which could adversely impact our financial results.\nThe results of operations of, and certain of our intercompany balances associated with, our international websites and product and service offerings are exposed to foreign exchange rate fluctuations. Upon translation, operating results may differ materially from expectations, and we may record significant gains or losses on the remeasurement of intercompany balances. As we have expanded our international operations, our exposure to exchange rate fluctuations has increased. We also hold cash equivalents and/or marketable securities in foreign currencies including British Pounds, Chinese Yuan, Euros, and Japanese Yen. If the U.S. Dollar strengthens compared to these currencies, cash equivalents, and marketable securities balances, when translated, may be materially less than expected and vice versa.\nThe Loss of Key Senior Management Personnel Could Negatively Affect Our Business\nWe depend on our senior management and other key personnel, particularly Jeffrey P. Bezos, our President, CEO, and Chairman. We do not have “key person” life insurance policies. The loss of any of our executive officers or other key employees could harm our business.\nWe Could Be Harmed by Data Loss or Other Security Breaches\nAs a result of our services being web-based and the fact that we process, store, and transmit large amounts of data, including personal information, for our customers, failure to prevent or mitigate data loss or other security breaches, including breaches of our vendors’ technology and systems, could expose us or our customers to a risk of loss or misuse of such information, adversely affect our operating results, result in litigation or potential liability for us, and otherwise harm our business. We use third party technology and systems for a variety of reasons, including, without limitation, encryption and authentication technology, employee email, content delivery to customers, back-office support, and other functions. Some subsidiaries had past security breaches, and, although they did not have a material adverse effect on our operating results, there can be no assurance of a similar result in the future. Although we have developed systems and processes that are designed to protect customer information and prevent data loss and other security breaches, including systems and processes designed to reduce the impact of a security breach at a third party vendor, such measures cannot provide absolute security.\nWe Face Risks Related to System Interruption and Lack of Redundancy\nWe experience occasional system interruptions and delays that make our websites and services unavailable or slow to respond and prevent us from efficiently fulfilling orders or providing services to third parties, which may reduce our net sales and the attractiveness of our products and services. If we are unable to continually add software and hardware, effectively upgrade our systems and network infrastructure, and take other steps to improve the efficiency of our systems, it could cause system interruptions or delays and adversely affect our operating results.\nOur computer and communications systems and operations could be damaged or interrupted by fire, flood, power loss, telecommunications failure, earthquakes, acts of war or terrorism, acts of God, computer viruses, physical or electronic break-ins, and similar events or disruptions. Any of these events could cause system interruption, delays, and loss of critical data, and could prevent us from accepting and fulfilling customer orders and providing services, which could make our product and service offerings less attractive and subject us to liability. Our systems are not fully redundant and our disaster recovery planning may not be sufficient. In addition, we may have inadequate insurance coverage to compensate for any related losses. Any of these events could damage our reputation and be expensive to remedy.\nIn addition to risks described elsewhere in this Item 1A relating to fulfillment network and inventory optimization by us and third parties, we are exposed to significant inventory risks that may adversely affect our operating results as a result of seasonality, new product launches, rapid changes in product cycles and pricing, defective merchandise, changes in consumer demand and consumer spending patterns, changes in consumer tastes with respect to our products, and other factors. We endeavor to accurately predict these trends and avoid overstocking or understocking products we manufacture and/or sell. Demand for products, however, can change significantly between the time inventory or components are ordered and the date of sale. In addition, when we begin selling or manufacturing a new product, it may be difficult to establish vendor relationships, determine appropriate product or component selection, and accurately forecast demand. The acquisition of certain types of inventory or components may require significant lead-time and prepayment and they may not be returnable. We carry a broad selection and significant inventory levels of certain products, such as consumer electronics, and we may be unable to sell products in sufficient quantities or during the relevant selling seasons. Any one of the inventory risk factors set forth above may adversely affect our operating results.\nWe May Not Be Able to Adequately Protect Our Intellectual Property Rights or May Be Accused of Infringing Intellectual Property Rights of Third Parties\nWe regard our trademarks, service marks, copyrights, patents, trade dress, trade secrets, proprietary technology, and similar intellectual property as critical to our success, and we rely on trademark, copyright, and patent law, trade secret protection, and confidentiality and/or license agreements with our employees, customers, and others to protect our proprietary rights. Effective intellectual property protection may not be available in every country in which our products and services are made available. We also may not be able to acquire or maintain appropriate domain names in all countries in which we do business. Furthermore, regulations governing domain names may not protect our trademarks and similar proprietary rights. We may be unable to prevent third parties from acquiring domain names that are similar to, infringe upon, or diminish the value of our trademarks and other proprietary rights.\nWe may not be able to discover or determine the extent of any unauthorized use of our proprietary rights. Third parties that license our proprietary rights also may take actions that diminish the value of our proprietary rights or reputation. The protection of our intellectual property may require the expenditure of significant financial and managerial resources. Moreover, the steps we take to protect our intellectual property may not adequately protect our rights or prevent third parties from infringing or misappropriating our proprietary rights. We also cannot be certain that others will not independently develop or otherwise acquire equivalent or superior technology or other intellectual property rights.\nOther parties also may claim that we infringe their proprietary rights. We have been subject to, and expect to continue to be subject to, claims and legal proceedings regarding alleged infringement by us of the intellectual property rights of third parties. Such claims, whether or not meritorious, may result in the expenditure of significant financial and managerial resources, injunctions against us, or the payment of damages, including to satisfy indemnification obligations. We may need to obtain licenses from third parties who allege that we have infringed their rights, but such licenses may not be available on terms acceptable to us or at all. In addition, we may not be able to obtain or utilize on terms that are favorable to us, or at all, licenses or other rights with respect to intellectual property we do not own. These risks have been amplified by the increase in third parties whose sole or primary business is to assert such claims.\nOur digital content offerings depend in part on effective digital rights management technology to control access to digital content. If the digital rights management technology that we use is compromised or otherwise malfunctions, we could be subject to claims, and content providers may be unwilling to include their content in our service.\nWe Have a Rapidly Evolving Business Model and Our Stock Price Is Highly Volatile\nWe have a rapidly evolving business model. The trading price of our common stock fluctuates significantly in response to, among other risks, the risks described elsewhere in this Item 1A, as well as:\nconditions or trends in the Internet and the industry segments we operate in;\nfluctuations in the stock market in general and market prices for Internet-related companies in particular;\nchanges in financial estimates by us or securities analysts and recommendations by securities analysts;\nchanges in our capital structure, including issuance of additional debt or equity to the public;\nchanges in the valuation methodology of, or performance by, other e-commerce or technology companies; and\ntransactions in our common stock by major investors and certain analyst reports, news, and speculation.\nVolatility in our stock price could adversely affect our business and financing opportunities and force us to increase our cash compensation to employees or grant larger stock awards than we have historically, which could hurt our operating results or reduce the percentage ownership of our existing stockholders, or both.\nGovernment Regulation Is Evolving and Unfavorable Changes Could Harm Our Business\nWe are subject to general business regulations and laws, as well as regulations and laws specifically governing the Internet, e-commerce, electronic devices, and other services. Existing and future laws and regulations may impede our growth. These regulations and laws may cover taxation, privacy, data protection, pricing, content, copyrights, distribution, mobile communications, electronic device certification, electronic waste, energy consumption, environmental regulation, electronic contracts and other communications, competition, consumer protection, web services, the provision of online payment services, information reporting requirements, unencumbered Internet access to our services or access to our facilities, the design and operation of websites, the characteristics and quality of products and services, and the commercial operation of unmanned aircraft systems. It is not clear how existing laws governing issues such as property ownership, libel, and personal privacy apply to the Internet, e-commerce, digital content, and web services. Jurisdictions may regulate consumer-to-consumer online businesses, including certain aspects of our seller programs. Unfavorable regulations and laws could diminish the demand for our products and services and increase our cost of doing business.\nWe Could Be Subject to Additional Sales Tax or Other Indirect Tax Liabilities\nU.S. Supreme Court decisions restrict the imposition of obligations to collect state and local sales taxes with respect to remote sales in the U.S. However, an increasing number of states, and certain foreign jurisdictions, have considered or adopted laws or administrative practices that attempt to impose obligations on remote sellers and online marketplaces to collect taxes on their behalf. We support a Federal law that would allow states to require sales tax collection by remote sellers under a nationwide system. More than half of our revenue is already earned in jurisdictions where we collect sales tax or its equivalent. A successful assertion by one or more states or foreign countries requiring us to collect taxes where we do not do so could result in substantial tax liabilities, including for past sales, as well as penalties and interest. In addition, if the tax authorities in jurisdictions where we already collect sales tax or other indirect taxes were successfully to challenge our positions, our tax liability could increase substantially.\nWe Could Be Subject to Additional Income Tax Liabilities\nWe are subject to income taxes in the U.S. (federal and state) and numerous foreign jurisdictions. Tax laws, regulations, and administrative practices in various jurisdictions may be subject to significant change due to economic, political, and other conditions, and significant judgment is required in evaluating and estimating our provision and accruals for these taxes. There are many transactions that occur during the ordinary course of business for which the ultimate tax determination is uncertain. Our effective tax rates could be adversely affected by earnings being lower than anticipated in jurisdictions where we have lower statutory rates and higher than anticipated in jurisdictions where we have higher statutory rates, losses incurred in jurisdictions for which we are not able to realize the related tax benefit, changes in foreign currency exchange rates, entry into new businesses and geographies and changes to our existing businesses, acquisitions (including integrations) and investments, changes in our deferred tax assets and liabilities and their valuation, and changes in the relevant tax, accounting, and other laws, regulations, administrative practices, principles, and interpretations, including fundamental changes to the tax laws applicable to corporate multinationals. The U.S., the European Union and its member states, and a number of other countries are actively pursuing changes in this regard. \nExcept as required under U.S. tax laws, we do not provide for U.S. taxes on our undistributed earnings of foreign subsidiaries that have not been previously taxed since we intend to invest such undistributed earnings indefinitely outside of the U.S. If our intent changes or if these funds are needed for our U.S. operations, we would be required to accrue or pay U.S. taxes on some or all of these undistributed earnings and our effective tax rate would be adversely affected. We are also currently subject to audit in various jurisdictions, and these jurisdictions may assess additional income tax liabilities against us. Developments in an audit, litigation, or the relevant laws, regulations, administrative practices, principles, and interpretations could have a material effect on our operating results or cash flows in the period or periods for which that development occurs, \nas well as for prior and subsequent periods. For instance, the IRS is seeking to increase our U.S. taxable income related to transfer pricing with our foreign subsidiaries for transactions undertaken in 2005 and 2006, and we are currently contesting the matter in U.S. Tax Court. In addition to the risk of additional tax for 2005 and 2006 transactions, if this litigation is adversely determined or if the IRS were to seek transfer pricing adjustments of a similar nature for transactions in subsequent years, we could be subject to significant additional tax liabilities. In addition, in October 2014, the European Commission opened a formal investigation to examine whether decisions by the tax authorities in Luxembourg with regard to the corporate income tax paid by certain of our subsidiaries comply with European Union rules on state aid. If this matter is adversely resolved, Luxembourg may be required to assess, and we may be required to pay, additional amounts with respect to current and prior periods and our taxes in the future could increase. Although we believe our tax estimates are reasonable, the final outcome of tax audits, investigations, and any related litigation could be materially different from our historical income tax provisions and accruals. \nOur Supplier Relationships Subject Us to a Number of Risks\nWe have significant suppliers, including licensors, and in some cases, limited or single-sources of supply, that are important to our sourcing, services, manufacturing, and any related ongoing servicing of merchandise and content. We do not have long-term arrangements with most of our suppliers to guarantee availability of merchandise, content, components, or services, particular payment terms, or the extension of credit limits. If our current suppliers were to stop selling or licensing merchandise, content, components, or services to us on acceptable terms, or delay delivery, including as a result of one or more supplier bankruptcies due to poor economic conditions, as a result of natural disasters, or for other reasons, we may be unable to procure alternatives from other suppliers in a timely and efficient manner and on acceptable terms, or at all. In addition, if our suppliers or other vendors violate applicable laws, regulations, our code of standards and responsibilities, or implement practices regarded as unethical, unsafe, or hazardous to the environment, it could damage our reputation, limit our growth, and negatively affect our operating results. \nWe May Be Subject to Risks Related to Government Contracts and Related Procurement Regulations\nOur contracts with U.S., as well as state, local, and foreign, government entities are subject to various procurement regulations and other requirements relating to their formation, administration, and performance. We may be subject to audits and investigations relating to our government contracts, and any violations could result in various civil and criminal penalties and administrative sanctions, including termination of contract, refunding or suspending of payments, forfeiture of profits, payment of fines, and suspension or debarment from future government business. In addition, such contracts may provide for termination by the government at any time, without cause.\nWe May Be Subject to Product Liability Claims if People or Property Are Harmed by the Products We Sell\nSome of the products we sell or manufacture may expose us to product liability claims relating to personal injury, death, or environmental or property damage, and may require product recalls or other actions. Certain third parties also sell products using our e-commerce platform that may increase our exposure to product liability claims, such as if these sellers do not have sufficient protection from such claims. Although we maintain liability insurance, we cannot be certain that our coverage will be adequate for liabilities actually incurred or that insurance will continue to be available to us on economically reasonable terms, or at all. In addition, some of our agreements with our vendors and sellers do not indemnify us from product liability.\nWe accept payments using a variety of methods, including credit card, debit card, credit accounts (including promotional financing), gift cards, direct debit from a customer’s bank account, consumer invoicing, physical bank check, and payment upon delivery. For existing and future payment options we offer to our customers, we may become subject to additional regulations and compliance requirements (including obligations to implement enhanced authentication processes that could result in significant costs and reduce the ease of use of our payments products), as well as fraud. For certain payment methods, including credit and debit cards, we pay interchange and other fees, which may increase over time and raise our operating costs and lower profitability. We rely on third parties to provide certain Amazon-branded payment methods and payment processing services, including the processing of credit cards, debit cards, electronic checks, and promotional financing. In each case, it could disrupt our business if these companies become unwilling or unable to provide these services to us. We also offer co-branded credit card programs, which could adversely affect our operating results if terminated. We are also subject to payment card association operating rules, including data security rules, certification requirements, and rules governing electronic funds transfers, which could change or be reinterpreted to make it difficult or impossible for us to comply. If we fail to comply with these rules or requirements, or if our data security systems are breached or compromised, we may be liable for card issuing banks’ costs, subject to fines and higher transaction fees, and lose our ability to accept credit and debit card payments from our customers, process electronic funds transfers, or facilitate other types of online payments, and our business and operating \nIn addition, we provide regulated services in certain jurisdictions because we enable customers to keep account balances with us and transfer money to third parties, and because we provide services to third parties to facilitate payments on their behalf. In these jurisdictions, we may be subject to requirements for licensing, regulatory inspection, bonding and capital maintenance, the use, handling, and segregation of transferred funds, consumer disclosures, and authentication. We are also subject to or voluntarily comply with a number of other laws and regulations relating to payments, money laundering, international money transfers, privacy and information security, and electronic fund transfers. If we were found to be in violation of applicable laws or regulations, we could be subject to additional requirements and civil and criminal penalties, or forced to cease providing certain services.\nWe Could Be Liable for Fraudulent or Unlawful Activities of Sellers\nThe law relating to the liability of providers of online payment services is currently unsettled. In addition, governmental agencies could require changes in the way this business is conducted. Under our seller programs, we may be unable to prevent sellers from collecting payments, fraudulently or otherwise, when buyers never receive the products they ordered or when the products received are materially different from the sellers’ descriptions. Under our A2Z Guarantee, we reimburse buyers for payments up to certain limits in these situations, and as our marketplace seller sales grow, the cost of this program will increase and could negatively affect our operating results. We also may be unable to prevent sellers on our sites or through other seller sites from selling unlawful goods, selling goods in an unlawful manner, or violating the proprietary rights of others, and could face civil or criminal liability for unlawful activities by our sellers.", "13": "Certain Relationships and Related Transactions, and Director Independence \nInformation required by Item 13 of Part III is included in our Proxy Statement relating to our \n Annual Meeting of Shareholders and is incorporated herein by reference. ", "12": "Security Ownership of Certain Beneficial Owners and Management and Related Shareholder Matters \nInformation required by Item 12 of Part III is included in our Proxy Statement relating to our \n Annual Meeting of Shareholders and is incorporated herein by reference. ", "14": "Information required by Item 14 of Part III is included in our Proxy Statement relating our \n Annual Meeting of Shareholders and is incorporated herein by reference. ", "7A": "Quantitative and Qualitative Disclosures About Market Risk\nWe are exposed to market risk for the effect of interest rate changes, foreign currency fluctuations, and changes in the market values of our investments. Information relating to quantitative and qualitative disclosures about market risk is set forth below and in Item 7 of Part II, “Management’s Discussion and Analysis of Financial Condition and Results of Operations—Liquidity and Capital Resources.”\nOur exposure to market risk for changes in interest rates relates primarily to our investment portfolio and our long-term debt. Our long-term debt is carried at amortized cost and fluctuations in interest rates do not impact our consolidated financial statements. However, the fair value of our debt, which pays interest at a fixed rate, will generally fluctuate with movements of interest rates, increasing in periods of declining rates of interest and declining in periods of increasing rates of interest. All of our cash equivalent and marketable fixed income securities are designated as available-for-sale and, accordingly, are presented at fair value on our consolidated balance sheets. We generally invest our excess cash in investment grade short- to intermediate-term fixed income securities and AAA-rated money market funds. Fixed income securities may have their fair market value adversely affected due to a rise in interest rates, and we may suffer losses in principal if forced to sell securities that have declined in market value due to changes in interest rates.\nThe following table provides information about our current and long-term cash equivalents and marketable fixed income securities, including principal cash flows by expected maturity and the related weighted-average interest rates as of \nCash equivalent and marketable fixed income securities\n of debt, including the current portion, primarily consisting of the following fixed rate unsecured debt (in millions):\nThe fair value of our debt will fluctuate with movements of interest rates, increasing in periods of declining rates of interest and declining in periods of increasing rates of interest. Based upon quoted market prices and Level 2 inputs, the fair value of our total debt was \n, net sales from our International segment accounted for \n of our consolidated revenues. Net sales and related expenses generated from our internationally-focused websites, and from www.amazon.ca\nand www.amazon.com.mx (which are included in our North America segment), are primarily denominated in the functional currencies of the corresponding websites and primarily include Euros, Japanese Yen, and British Pounds. The results of operations of, and certain of our intercompany balances associated with, our internationally-focused websites and AWS are exposed to foreign exchange rate fluctuations. Upon consolidation, as foreign exchange rates vary, net sales and other operating results may differ materially from expectations, and we may record significant gains or losses on the remeasurement of intercompany balances. For example, as a result of fluctuations in foreign exchange rates during \nWe have foreign exchange risk related to foreign-denominated cash, cash equivalents, and marketable securities (“foreign funds”). Based on the balance of foreign funds as of \n, an assumed 5%, 10%, and 20% adverse change to foreign exchange would result in fair value declines of $365 million, $730 million, and $1.5 billion. All investments are classified as “available-for-sale.” Fluctuations in fair value are recorded in “Accumulated other comprehensive loss,” a separate component of stockholders’ equity.\nWe have foreign exchange risk related to our intercompany balances denominated in various foreign currencies. Based on the intercompany balances as of \n, an assumed 5%, 10%, and 20% adverse change to foreign exchange would result in losses of $190 million, $405 million, and $905 million, recorded to “Other income (expense), net.”\nSee Item 7 of Part II, “Management’s Discussion and Analysis of Financial Condition and Results of Operations—Results of Operations—Effect of Foreign Exchange Rates” for additional information on the effect on reported results of changes in foreign exchange rates.\n, our recorded basis in equity investments was $280 million. These investments primarily relate to equity-method and cost-method investments in private companies. We review our investments for impairment when events and circumstances indicate that the decline in fair value of such assets below the carrying value is other-than-temporary. Our analysis includes a review of recent operating results and trends, recent sales/acquisitions of the investee securities, and other publicly available data. The current global economic climate provides additional uncertainty. Valuations of private companies are inherently more complex due to the lack of readily available market data. As such, we believe that market sensitivities are not practicable.", "10": "Directors, Executive Officers, and Corporate Governance \nInformation regarding our Executive Officers required by Item 10 of Part III is set forth in Item 1 of Part I “Business—Executive Officers of the Registrant.” Information required by Item 10 of Part III regarding our Directors and any material changes to the process by which security holders may recommend nominees to the Board of Directors is included in our Proxy Statement relating to our \n Annual Meeting of Shareholders, and is incorporated herein by reference. Information relating to our Code of Business Conduct and Ethics and to compliance with Section 16(a) of the 1934 Act is set forth in our Proxy Statement relating to our \n Annual Meeting of Shareholders and is incorporated herein by reference. To the extent permissible under NASDAQ rules, we intend to disclose amendments to our Code of Business Conduct and Ethics, as well as waivers of the provisions thereof, on our investor relations website under the heading “Corporate Governance” at www.amazon.com/ir. ", "9A": "We carried out an evaluation required by the Securities Exchange Act of 1934 (the “1934 Act”), under the supervision and with the participation of our principal executive officer and principal financial officer, of the effectiveness of the design and operation of our disclosure controls and procedures, as defined in Rule 13a-15(e) of the 1934 Act, as of \n. Based on this evaluation, our principal executive officer and principal financial officer concluded that, as of \n, our disclosure controls and procedures were effective to provide reasonable assurance that information required to be disclosed by us in the reports that we file or submit under the 1934 Act is recorded, processed, summarized, and reported within the time periods specified in the SEC’s rules and forms and to provide reasonable assurance that such information is accumulated and communicated to our management, including our principal executive officer and principal financial officer, as appropriate to allow timely decisions regarding required disclosure.\nManagement’s Report on Internal Control over Financial Reporting \nManagement is responsible for establishing and maintaining adequate internal control over financial reporting, as defined in Rule 13a-15(f) of the 1934 Act. Management has assessed the effectiveness of our internal control over financial reporting as of \n based on criteria established in Internal Control—Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission. As a result of this assessment, management concluded that, as of \n, our internal control over financial reporting was effective in providing reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. Ernst & Young has independently assessed the effectiveness of our internal control over financial reporting and its report is included below. \nChanges in Internal Control Over Financial Reporting \nThere were no changes in our internal control over financial reporting during the quarter ended \n that materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. \nOur disclosure controls and procedures and internal control over financial reporting are designed to provide reasonable assurance of achieving their objectives as specified above. Management does not expect, however, that our disclosure controls and procedures or our internal control over financial reporting will prevent or detect all error and fraud. Any control system, no matter how well designed and operated, is based upon certain assumptions and can provide only reasonable, not absolute, assurance that its objectives will be met. Further, no evaluation of controls can provide absolute assurance that misstatements due to error or fraud will not occur or that all control issues and instances of fraud, if any, within the Company have been detected. \nReport of Independent Registered Public Accounting Firm \nWe have audited Amazon.com, Inc.’s internal control over financial reporting as of \n, based on criteria established in Internal Control—Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) (the COSO criteria). Amazon.com, Inc.’s management is responsible for maintaining effective internal control over financial reporting, and for its assessment of the effectiveness of internal control over financial reporting included in the accompanying Management’s Report on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. \nWe conducted our audit in accordance with the standards of the Public Company Accounting Oversight Board (United States). Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects. Our audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion. \nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements. \nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate. \nIn our opinion, Amazon.com, Inc. maintained, in all material respects, effective internal control over financial reporting as of \nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States), the consolidated balance sheets of Amazon.com, Inc. as of \n, and the related consolidated statements of operations, comprehensive income (loss), stockholders’ equity, and cash flows for each of the three years in the period ended ", "9B": "", "1": "This Annual Report on Form 10-K and the documents incorporated herein by reference contain forward-looking statements based on expectations, estimates, and projections as of the date of this filing. Actual results may differ materially from those expressed in forward-looking statements. See Item 1A of Part I—“Risk Factors.”\nAmazon.com, Inc. was incorporated in 1994 in the state of Washington and reincorporated in 1996 in the state of Delaware. Our principal corporate offices are located in Seattle, Washington. We completed our initial public offering in May 1997 and our common stock is listed on the NASDAQ Global Select Market under the symbol “AMZN.”\nAs used herein, “Amazon.com,” “we,” “our,” and similar terms include Amazon.com, Inc. and its subsidiaries, unless the context indicates otherwise.\nAmazon.com opened its virtual doors on the World Wide Web in July 1995. We seek to be Earth’s most customer-centric company. We are guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. In each of our segments, we serve our primary customer sets, consisting of consumers, sellers, developers, enterprises, and content creators. In addition, we provide services, such as advertising services and co-branded credit card agreements.\nBeginning in the first quarter of 2015, we changed our reportable segments to North America, International, and Amazon Web Services (“AWS”). These segments reflect the way the Company evaluates its business performance and manages its operations. Additional information on our operating segments and product information is contained in Item 8 of Part II, “Financial Statements and Supplementary Data—Note 11—Segment Information.” See Item 7 of Part II, “Management’s Discussion and Analysis of Financial Condition and Results of Operations—Results of Operations—Supplemental Information” for supplemental information about our net sales. Our company-sponsored research and development expense is set forth within “Technology and content” in Item 8 of Part II, “Financial Statements and Supplementary Data—Consolidated Statements of Operations.”\nWe serve consumers through our retail websites and focus on selection, price, and convenience. We design our websites to enable millions of unique products to be sold by us and by third parties across dozens of product categories. Customers access our websites directly and through our mobile websites and apps. We also manufacture and sell electronic devices, including Kindle e-readers, Fire tablets, Fire TVs, and Echo. We strive to offer our customers the lowest prices possible through low everyday product pricing and shipping offers, and to improve our operating efficiencies so that we can continue to lower prices for our customers. We also provide easy-to-use functionality, fast and reliable fulfillment, and timely customer service. In addition, we offer Amazon Prime, an annual membership program that includes unlimited free shipping on millions of items, access to unlimited instant streaming of thousands of movies and TV episodes, and other benefits.\nWe fulfill customer orders in a number of ways, including through: North America and International fulfillment and delivery networks that we operate; co-sourced and outsourced arrangements in certain countries; and digital delivery. We operate customer service centers globally, which are supplemented by co-sourced arrangements. See Item 2 of Part I, “Properties.”\nWe offer programs that enable sellers to sell their products on our websites and their own branded websites and to fulfill orders through us. We are not the seller of record in these transactions, but instead earn fixed fees, a percentage of sales, per-unit activity fees, or some combination thereof.\nWe serve developers and enterprises of all sizes, including start-ups, government agencies, and academic institutions, through our AWS segment, which offers a broad set of global compute, storage, database, and other service offerings. \nWe serve authors and independent publishers with Kindle Direct Publishing, an online platform that lets independent authors and publishers choose a 70% royalty option and make their books available in the Kindle Store, along with Amazon’s own publishing arm, Amazon Publishing. We also offer programs that allow authors, musicians, filmmakers, app developers, and others to publish and sell content.\nOur businesses encompass a large variety of product types, service offerings, and delivery channels. The international marketplace in which we compete is evolving rapidly and intensely competitive, and we face a broad array of competitors from many different industry sectors around the world. Our current and potential competitors include: (1) online, offline, and multichannel retailers, publishers, vendors, distributors, manufacturers, and producers of the products we offer and sell to consumers and businesses; (2) publishers, producers, and distributors of physical, digital, and interactive media of all types and all distribution channels; (3) web search engines, comparison shopping websites, social networks, web portals, and other online and app-based means of discovering, using, or acquiring goods and services, either directly or in collaboration with other retailers; (4) companies that provide e-commerce services, including website development, advertising, fulfillment, customer service, and payment processing; (5) companies that provide fulfillment and logistics services for themselves or for third parties, whether online or offline; (6) companies that provide information technology services or products, including on-premises or cloud-based infrastructure and other services; and (7) companies that design, manufacture, market, or sell consumer electronics, telecommunication, and electronic devices. We believe that the principal competitive factors in our retail businesses include selection, price, and convenience, including fast and reliable fulfillment. Additional competitive factors for our seller and enterprise services include the quality, speed, and reliability of our services and tools, as well as customers’ ability and willingness to change business practices. Some of our current and potential competitors have greater resources, longer histories, more customers, greater brand recognition, and greater control over inputs critical to our various businesses. They may secure better terms from suppliers, adopt more aggressive pricing, pursue restrictive distribution agreements that restrict our access to supply, direct consumers to their own offerings instead of ours, lock-in potential customers with restrictive terms, and devote more resources to technology, infrastructure, fulfillment, and marketing. Each of our businesses is also subject to rapid change and the development of new business models and the entry of new and well-funded competitors. Other companies also may enter into business combinations or alliances that strengthen their competitive positions.\nWe regard our trademarks, service marks, copyrights, patents, domain names, trade dress, trade secrets, proprietary technologies, and similar intellectual property as critical to our success, and we rely on trademark, copyright, and patent law, trade-secret protection, and confidentiality and/or license agreements with our employees, customers, partners, and others to protect our proprietary rights. We have registered, or applied for the registration of, a number of U.S. and international domain names, trademarks, service marks, and copyrights. Additionally, we have filed U.S. and international patent applications covering certain of our proprietary technology. We have licensed in the past, and expect that we may license in the future, certain of our proprietary rights to third parties.\nOur business is affected by seasonality, which historically has resulted in higher sales volume during our fourth quarter, which ends December 31. We recognized \n, 33%, and 34% of our annual revenue during the fourth quarter of \n. However, employment levels fluctuate due to seasonal factors affecting our business. Additionally, we utilize independent contractors and temporary personnel to supplement our workforce. We have works councils, statutory employee representation obligations, and union agreements in certain countries outside the United States. We consider our employee relations to be good. Competition for qualified personnel in our industry has historically been intense, particularly for software engineers, computer scientists, and other technical staff.\nOur investor relations website is www.amazon.com/ir and we encourage investors to use it as a way of easily finding information about us. We promptly make available on this website, free of charge, the reports that we file or furnish with the \nSecurities and Exchange Commission (“SEC”), corporate governance information (including our Code of Business Conduct and Ethics), and select press releases and social media postings.\nThe following tables set forth certain information regarding our Executive Officers and Directors as of \nPresident, Chief Executive Officer, and Chairman of the Board\nSenior Vice President, International Consumer Business\nVice President, Worldwide Controller, and Principal Accounting Officer\nSenior Vice President, General Counsel, and Secretary\n Mr. Bezos has been Chairman of the Board of Amazon.com since founding it in 1994 and Chief Executive Officer since May 1996. Mr. Bezos served as President of the Company from founding until June 1999 and again from October 2000 to the present.\n Mr. Blackburn has served as Senior Vice President, Business Development, since April 2006.\n Mr. Jassy has served as Senior Vice President, Amazon Web Services, since April 2006.\n Mr. Olsavsky has served as Senior Vice President and Chief Financial Officer since June 2015, Vice President, Finance for the Global Consumer Business from December 2011 to June 2015, and numerous financial leadership roles across Amazon with global responsibility since April 2002. \n Mr. Piacentini has served as Senior Vice President, International Consumer Business, since February 2012, and as Senior Vice President, International Retail, from January 2007 until February 2012.\n Ms. Reynolds has served as Vice President, Worldwide Controller, and Principal Accounting Officer since April 2007.\n Mr. Wilke has served as Senior Vice President, Consumer Business, since February 2012, and as Senior Vice President, North America Retail, from January 2007 until February 2012.\n Mr. Zapolsky has served as Senior Vice President, General Counsel, and Secretary since May 2014, Vice President, General Counsel, and Secretary from September 2012 to May 2014, and as Vice President and Associate General Counsel for Litigation and Regulatory matters from April 2002 until September 2012.\nPresident, Chief Executive Officer, and Chairman of the Board\nVisiting Scholar and Advisor to the Provost, University of Southern California\nPresident, Astronauts Wanted * No experience necessary\nRetired, Former Chairman, Reader’s Digest Association, Inc.\nPresident and Chief Executive Officer, Martha’s Table", "9": "Changes in and Disagreements with Accountants On Accounting and Financial Disclosure", "3": "See Item 8 of Part II, “Financial Statements and Supplementary Data—Note 7—Commitments and Contingencies—Legal Proceedings.”", "2": ", we operated the following facilities (in thousands):\nFor leased properties, represents the total leased space excluding sub-leased space.\nSegment amounts exclude corporate facilities. Shared facilities are allocated among the segments based on usage and primarily relate to facilities that hold our technology infrastructure. See Item 8 of Part II, “Financial Statements and Supplementary Data—Note 11—Segment Information.”\nWe own and lease our corporate headquarters in Seattle, Washington. Additionally, we own and lease corporate office, fulfillment, sortation, delivery, warehouse operations, data center, customer service, and other facilities, principally in North America, Europe, and Asia.", "5": "Market for the Registrant’s Common Stock, Related Shareholder Matters, and Issuer Purchases of Equity Securities\nOur common stock is traded on the NASDAQ Global Select Market under the symbol “AMZN.” The following table sets forth the high and low per share sale prices for our common stock for the periods indicated, as reported by the NASDAQ Global Select Market.\n, there were 2,578 shareholders of record of our common stock, although there is a much larger number of beneficial owners.\nWe have never declared or paid cash dividends on our common stock. See Item 7 of Part II, “Management’s Discussion and Analysis of Financial Condition and Results of Operations—Liquidity and Capital Resources.”", "4": "", "7": "Management’s Discussion and Analysis of Financial Condition and Results of Operations\nThis Annual Report on Form 10-K includes forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. All statements other than statements of historical fact, including statements regarding guidance, industry prospects, or future results of operations or financial position, made in this Annual Report on Form 10-K are forward-looking. We use words such as anticipates, believes, expects, future, intends, and similar expressions to identify forward-looking statements. Forward-looking statements reflect management’s current expectations and are inherently uncertain. Actual results could differ materially for a variety of reasons, including, among others, fluctuations in foreign exchange rates, changes in global economic conditions and customer spending, world events, the rate of growth of the Internet and online commerce, the amount that Amazon.com invests in new business opportunities and the timing of those investments, the mix of products sold to customers, the mix of net sales derived from products as compared with services, the extent to which we owe income taxes, competition, management of growth, potential fluctuations in operating results, international growth and expansion, the outcomes of legal proceedings and claims, fulfillment, sortation, delivery, and data center optimization, risks of inventory management, seasonality, the degree to which we enter into, maintain, and develop commercial agreements, acquisitions and strategic transactions, payments risks, and risks of fulfillment throughput and productivity. In addition, the current global economic climate amplifies many of these risks. These risks and uncertainties, as well as other risks and uncertainties that could cause our actual results to differ significantly from management’s expectations, are described in greater detail in Item 1A of Part I, “Risk Factors.”\nOur primary source of revenue is the sale of a wide range of products and services to customers\n. The products offered on our consumer-facing websites primarily include merchandise and content we have purchased for resale from vendors and those offered by third-party sellers, and we also manufacture and sell electronic devices. Generally, we recognize gross revenue from items we sell from our inventory as product sales and recognize our net share of revenue of items sold by third-party sellers as service sales. We also offer other services such as compute, storage, and database offerings, fulfillment, publishing, digital content subscriptions, advertising, and co-branded credit cards.\nOur financial focus is on long-term, sustainable growth in free cash flows\n Free cash flows are driven primarily by increasing operating income and efficiently managing working capital\n and cash capital expenditures, including our decision to purchase or lease property and equipment. Increases in operating income primarily result from increases in sales of products and services and efficiently managing our operating costs, partially offset by investments we make in longer-term strategic initiatives. To increase sales of products and services, we focus on improving all aspects of the customer experience, including lowering prices, improving availability, offering faster delivery and performance times, increasing selection, increasing product categories and service offerings, expanding product information, improving ease of use, improving reliability, and earning customer trust. We also seek to efficiently manage shareholder dilution while maintaining the flexibility to issue shares for strategic purposes, such as financings, acquisitions, and aligning employee compensation with shareholders’ interests. We utilize restricted stock units as our primary vehicle for equity compensation because we believe this compensation model aligns the long-term interests of our shareholders and employees. In measuring shareholder dilution, we include all vested and unvested stock awards outstanding, without regard to estimated forfeitures. Total shares outstanding plus outstanding stock awards were \nWe seek to reduce our variable costs per unit and work to leverage our fixed costs.\n Our variable costs include product and content costs, payment processing and related transaction costs, picking, packaging, and preparing orders for shipment, transportation, customer service support, costs necessary to run AWS, and a portion of our marketing costs. Our fixed costs include the costs necessary to run our technology infrastructure; to build, enhance, and add features to our websites and web services, our electronic devices, and digital offerings; and to build and optimize our fulfillment centers. Variable costs generally change directly with sales volume, while fixed costs generally are dependent on the timing of capacity needs, geographic expansion, category expansion, and other factors. To decrease our variable costs on a per unit basis and enable us to lower prices for customers, we seek to increase our direct sourcing, increase discounts from suppliers, and reduce defects in our processes. To minimize growth in fixed costs, we seek to improve process efficiencies and maintain a lean culture.\nSee “Results of Operations—Non-GAAP Financial Measures” below for additional information on our non-GAAP free cash flows financial measures.\nWorking capital consists of accounts receivable, inventory, and accounts payable.\nBecause of our model we are able to turn our inventory quickly and have a cash-generating operating cycle\n On average, our high inventory velocity means we generally collect from consumers before our payments to suppliers come due. Inventory turnover\n. We expect variability in inventory turnover over time since it is affected by several factors, including our product mix, the mix of sales by us and by third-party sellers, our continuing focus on in-stock inventory availability and selection of product offerings, our investment in new geographies and product lines, and the extent to which we choose to utilize third-party fulfillment providers. Accounts payable days\n. We expect some variability in accounts payable days over time since they are affected by several factors, including the mix of product sales, the mix of sales by third-party sellers, the mix of suppliers, seasonality, and changes in payment terms over time, including the effect of balancing pricing and timing of payment terms with suppliers.\nWe expect spending in technology and content will increase over time as we add computer scientists, designers, software and hardware engineers, and merchandising employees. Our technology and content investment and capital spending projects often support a variety of product and service offerings due to geographic expansion and the cross-functionality of our systems and operations. We seek to invest efficiently in several areas of technology and content, including AWS, and expansion of new and existing product categories and service offerings, as well as in technology infrastructure to enhance the customer experience and improve our process efficiencies.\n We believe that advances in technology, specifically the speed and reduced cost of processing power and the advances of wireless connectivity, will continue to improve the consumer experience on the Internet and increase its ubiquity in people’s lives. To best take advantage of these continued advances in technology, we are investing in initiatives to build and deploy innovative and efficient software and electronic devices. We are also investing in AWS, which offers a broad set of global compute, storage, database, and other service offerings to developers and enterprises of all sizes.\nOur financial reporting currency is the U.S. Dollar and changes in foreign exchange rates significantly affect our reported results and consolidated trends\n. For example, if the U.S. Dollar weakens year-over-year relative to currencies in our international locations, our consolidated net sales and operating expenses will be higher than if currencies had remained constant. Likewise, if the U.S. Dollar strengthens year-over-year relative to currencies in our international locations, our consolidated net sales and operating expenses will be lower than if currencies had remained constant. We believe that our increasing diversification beyond the U.S. economy through our growing international businesses benefits our shareholders over the long-term. We also believe it is useful to evaluate our operating results and growth rates before and after the effect of currency changes.\nIn addition, the remeasurement of our intercompany balances can result in significant gains and charges associated with the effect of movements in foreign currency exchange rates. Currency volatilities may continue, which may significantly impact (either positively or negatively) our reported results and consolidated trends and comparisons.\nFor additional information about each line item summarized above, refer to Item 8 of Part II, “Financial Statements and Supplementary Data—Note 1—Description of Business and Accounting Policies.”\nThe preparation of financial statements in conformity with generally accepted accounting principles of the United States (“GAAP”) requires estimates and assumptions that affect the reported amounts of assets and liabilities, revenues and expenses, and related disclosures of contingent assets and liabilities in the consolidated financial statements and accompanying notes. The SEC has defined a company’s critical accounting policies as the ones that are most important to the portrayal of the company’s financial condition and results of operations, and which require the company to make its most difficult and subjective judgments, often as a result of the need to make estimates of matters that are inherently uncertain. Based on this definition, we have identified the critical accounting policies and judgments addressed below. We also have other key accounting policies, which involve the use of estimates, judgments, and assumptions that are significant to understanding our results. For additional information, see Item 8 of Part II, “Financial Statements and Supplementary Data—Note 1—Description of Business and Accounting Policies.” Although we believe that our estimates, assumptions, and judgments are reasonable, they are based upon information presently available. Actual results may differ significantly from these estimates under different assumptions, judgments, or conditions.\nThe operating cycle is the number of days of sales in inventory plus the number of days of sales in accounts receivable minus accounts payable days.\nInventory turnover is the quotient of trailing twelve month cost of sales to average inventory over five quarter ends.\nAccounts payable days, calculated as the quotient of accounts payable to current quarter cost of sales, multiplied by the number of days in the current quarter. \nInventories, consisting of products available for sale, are primarily accounted for using the first-in first-out (“FIFO”) method, and are valued at the lower of cost or market value. This valuation requires us to make judgments, based on currently-available information, about the likely method of disposition, such as through sales to individual customers, returns to product vendors, or liquidations, and expected recoverable values of each disposition category. These assumptions about future disposition of inventory are inherently uncertain and changes in our estimates and assumptions may cause us to realize material write-downs in the future. As a measure of sensitivity, for every 1% of additional inventory valuation allowance as of \n, we would have recorded an additional cost of sales of approximately $115 million.\nIn addition, we enter into supplier commitments for certain electronic device components. These commitments are based on forecasted customer demand. If we reduce these commitments, we may incur additional costs.\nWe evaluate goodwill for impairment annually or more frequently when an event occurs or circumstances change that indicate the carrying value may not be recoverable. During the second quarter of 2015, we changed the measurement date of our annual goodwill impairment test from October 1 to April 1. In testing for goodwill impairment, we may elect to utilize a qualitative assessment to evaluate whether it is more likely than not that the fair value of a reporting unit is less than its carrying amount. If our qualitative assessment indicates that goodwill impairment is more likely than not, we perform a two-step impairment test. We test goodwill for impairment under the two-step impairment test by first comparing the book value of net assets to the fair value of the reporting units. If the fair value is determined to be less than the book value or qualitative factors indicate that it is more likely than not that goodwill is impaired, a second step is performed to compute the amount of impairment as the difference between the estimated fair value of goodwill and the carrying value. We estimate the fair value of the reporting units using discounted cash flows. Forecasts of future cash flows are based on our best estimate of future net sales and operating expenses, based primarily on expected category expansion, pricing, market segment share, and general economic conditions. Certain estimates of discounted cash flows involve businesses and geographies with limited financial history and developing revenue models. Changes in these forecasts could significantly change the amount of impairment recorded, if any.\nDuring the year, management monitored the actual performance of the business relative to the fair value assumptions used during our annual goodwill impairment test. For the periods presented, no triggering events were identified that required an interim impairment test. As a measure of sensitivity, a 10% decrease in the fair value of any of our reporting units as of April 1, 2015, would have had no impact on the carrying value of our goodwill.\nFinancial and credit market volatility directly impacts the fair value measurement through our weighted-average cost of capital that we use to determine a discount rate and through our stock price that we use to determine our market capitalization. During times of volatility, significant judgment must be applied to determine whether credit or stock price changes are short-term in nature or a longer-term trend. We have not made any significant changes to the accounting methodology used to evaluate goodwill for impairment. Changes in our estimated future cash flows and asset fair values may cause us to realize material impairment charges in the future. As a measure of sensitivity, a prolonged 20% decrease from our \n closing stock price would not be an indicator of possible impairment.\nWe measure compensation cost for stock awards at fair value and recognize it as compensation expense over the service period for awards expected to vest. The fair value of restricted stock units is determined based on the number of shares granted and the quoted price of our common stock and the fair value of stock options is estimated on the date of grant using a Black-Scholes model. The estimated number of stock awards that will ultimately vest requires judgment, and to the extent actual results or updated estimates differ from our current estimates, such amounts will be recorded as a cumulative adjustment in the period estimates are revised. We consider many factors when estimating expected forfeitures, including employee level, economic conditions, time remaining to vest, and historical forfeiture experience. We update our estimated forfeiture rate quarterly. We have not made any significant changes to the accounting methodology used to evaluate stock-based compensation. Changes in our estimates and assumptions may cause us to realize material changes in stock-based compensation expense in the future. As a measure of sensitivity, a 1% change to our estimated forfeiture rate would have had an approximately $46 million impact on our \n operating income. Our estimated forfeiture rates as of \nWe utilize the accelerated method, rather than the straight-line method, for recognizing compensation expense. For example, over 50% of the compensation cost related to an award vesting ratably over four years is expensed in the first year. If forfeited early in the life of an award, the compensation expense adjustment is much greater under an accelerated method than under a straight-line method.\nWe are subject to income taxes in the U.S. (federal and state) and numerous foreign jurisdictions. Tax laws, regulations, and administrative practices in various jurisdictions may be subject to significant change due to economic, political, and other conditions, and significant judgment is required in evaluating and estimating our provision and accruals for these taxes. There are many transactions that occur during the ordinary course of business for which the ultimate tax determination is uncertain. Our effective tax rates could be adversely affected by earnings being lower than anticipated in jurisdictions where we have lower statutory rates and higher than anticipated in jurisdictions where we have higher statutory rates, losses incurred in jurisdictions for which we are not able to realize the related tax benefit, changes in foreign currency exchange rates, entry into new businesses and geographies and changes to our existing businesses, acquisitions (including integrations) and investments, changes in our deferred tax assets and liabilities and their valuation, and changes in the relevant tax, accounting, and other laws, regulations, administrative practices, principles, and interpretations, including fundamental changes to the tax laws applicable to corporate multinationals. The U.S., the European Union and its member states, and a number of other countries are actively pursuing changes in this regard. \nExcept as required under U.S. tax laws, we do not provide for U.S. taxes on our undistributed earnings of foreign subsidiaries that have not been previously taxed since we intend to invest such undistributed earnings indefinitely outside of the U.S. If our intent changes or if these funds are needed for our U.S. operations, we would be required to accrue or pay U.S. taxes on some or all of these undistributed earnings and our effective tax rate would be adversely affected. We are also currently subject to audit in various jurisdictions, and these jurisdictions may assess additional income tax liabilities against us. Developments in an audit, litigation, or the relevant laws, regulations, administrative practices, principles, and interpretations could have a material effect on our operating results or cash flows in the period or periods for which that development occurs, as well as for prior and subsequent periods. For instance, the IRS is seeking to increase our U.S. taxable income related to transfer pricing with our foreign subsidiaries for transactions undertaken in 2005 and 2006, and we are currently contesting the matter in U.S. Tax Court. In addition to the risk of additional tax for 2005 and 2006 transactions, if this litigation is adversely determined or if the IRS were to seek transfer pricing adjustments of a similar nature for transactions in subsequent years, we could be subject to significant additional tax liabilities. In addition, in October 2014, the European Commission opened a formal investigation to examine whether decisions by the tax authorities in Luxembourg with regard to the corporate income tax paid by certain of our subsidiaries comply with European Union rules on state aid. If this matter is adversely resolved, Luxembourg may be required to assess, and we may be required to pay, additional amounts with respect to current and prior periods and our taxes in the future could increase. Although we believe our tax estimates are reasonable, the final outcome of tax audits, investigations, and any related litigation could be materially different from our historical income tax provisions and accruals. \nSee Item 8 of Part II, “Financial Statements and Supplementary Data—Note 1—Description of Business and Accounting Policies—Recent Accounting Pronouncements.”\nOur principal sources of liquidity are cash flows generated from operations and our cash, cash equivalents, and marketable securities balances, which, at fair value, were \n, and were primarily Euros, Japanese Yen, and British Pounds.\n. Our operating cash flows result primarily from cash received from our consumer, seller, developer, enterprise, and content creator customers, advertising agreements, and our co-branded credit card agreements, offset by cash payments we make for products and services, employee compensation (less amounts capitalized related to internal-use software that are reflected as cash used in investing activities), payment processing and related transaction costs, operating leases, and interest payments on our long-term obligations. Cash received from our customers and other activities generally corresponds to our net sales. Because consumers primarily use credit cards to buy from us, our receivables from consumers settle quickly. The \n, compared to the comparable prior year period, was primarily due to the increase in net income (loss), excluding non-cash charges to net income (loss) such as depreciation, amortization, and stock-based compensation, and changes in working capital. The \n, compared to the comparable prior year period, was primarily due to the increase in non-cash charges to net income (loss), including depreciation, amortization, and stock-based compensation, partially offset by changes in working capital. \nCash provided by (used in) investing activities corresponds with cash capital expenditures, including leasehold improvements, internal-use software and website development costs, cash outlays for acquisitions, investments in other companies and intellectual property rights, and purchases, sales, and maturities of marketable securities. Cash provided by (used in) investing activities was \n, with the variability caused primarily by our decision to purchase or lease property and equipment, purchases, maturities, and sales of marketable securities, and changes in cash paid for acquisitions. Cash capital expenditures were \n. This primarily reflects additional investments in support of continued business growth due to investments in technology infrastructure (the majority of which is to support AWS), and additional capacity to support our fulfillment operations, during all three periods. Capital expenditures included $528 million, $537 million, and $493 million for internal-use software and website development in \n. Stock-based compensation capitalized for internal-use software and website development costs does not affect cash flows. In \n, we made cash payments, net of acquired cash, related to acquisition and other investment activity of \nCash provided by (used in) financing activities was \n. Cash outflows from financing activities result from principal repayments on obligations related to capital leases and finance leases and repayments of long-term debt and other. Principal repayments on obligations related to capital leases and finance leases and repayments of long-term debt and other were \n. The increase in 2015 primarily reflects additional repayments on capital leases as well as a $750 million repayment on our unsecured senior notes. Property and equipment acquired under capital leases were \n reflecting additional investments in support of continued business growth primarily due to investments in technology infrastructure for AWS. We expect this trend toward additional investment to continue over time. Cash inflows from financing activities primarily result from proceeds from long-term debt and other and tax benefits relating to excess stock-based compensation deductions. Proceeds from long-term debt and other were \n. During 2014, cash inflows from financing activities consisted primarily of net proceeds from the issuance of $6.0 billion of senior nonconvertible unsecured debt in five tranches maturing in 2019 through 2044. See Item 8 of Part II, “Financial Statements and Supplementary Data—Note 5—Long-Term Debt” for additional discussion of the notes. Tax benefits relating to excess stock-based compensation deductions are presented as financing cash flows. Cash inflows from tax benefits related to stock-based compensation deductions were \nWe had no borrowings outstanding under our $2.0 billion Credit Agreement as of \n. See Item 8 of Part II, “Financial Statements and Supplementary Data—Note 5—Long-Term Debt” for additional information. \n. Except as required under U.S. tax laws, we do not provide for U.S. taxes on our undistributed earnings of foreign subsidiaries that have not been previously taxed since we intend to invest such undistributed earnings indefinitely outside of the U.S. If our intent changes or if these funds are needed for our U.S. operations, we would be required to accrue or pay U.S. taxes on some or all of these undistributed earnings, and our effective tax rate would be adversely affected. As of \n, cash, cash equivalents, and marketable securities held by foreign subsidiaries were $5.8 billion, which included undistributed earnings of foreign subsidiaries indefinitely invested outside of the U.S. of \n. We have tax benefits relating to excess stock-based compensation deductions and accelerated depreciation deductions that are being utilized to reduce our U.S. taxable income. In December 2015, U.S. legislation was enacted that extended accelerated depreciation deductions on qualifying property through 2019. Cash taxes paid (net of refunds) were \n, our federal net operating loss carryforward was approximately \n of federal tax credits potentially available to offset future tax liabilities. Our federal tax credits are primarily related to the U.S. federal research and development credit, which was made permanent in 2015. As we utilize our federal net operating losses and tax credits, we expect cash paid for taxes to significantly increase. We endeavor to manage our global taxes on a cash basis, rather than on a financial reporting basis.\nOur liquidity is also affected by restricted cash balances that are pledged as collateral for standby and trade letters of credit, guarantees, debt, and real estate leases. To the extent we process payments for third-party sellers or offer certain types of stored value to our customers, some jurisdictions may restrict our use of those funds. These restrictions would result in the reclassification of a portion of our cash and cash equivalents from “Cash and cash equivalents” to restricted cash, which is classified within “Accounts receivable, net and other” on our consolidated balance sheets. As of \n, restricted cash, cash equivalents, and marketable securities were \n. See Item 8 of Part II, “Financial Statements and Supplementary Data—Note 7—Commitments and Contingencies” for additional discussion of our principal contractual commitments, as well as our pledged assets. Purchase obligations and open purchase orders, consisting of inventory and significant non-inventory commitments, were $6.2 billion as of \n. Purchase obligations and open purchase orders are generally cancellable in full or in part through the contractual provisions.\nOn average, our high inventory velocity means we generally collect from consumers before our payments to suppliers come due. Inventory turnover was \n. We expect variability in inventory turnover over time since it is affected by several factors, including our product mix, the mix of sales by us and by third-party sellers, our continuing focus on in-stock inventory availability and selection of product offerings, our investment in new geographies and product lines, and the extent to which we choose to utilize third-party fulfillment providers.\nWe believe that cash flows generated from operations and our cash, cash equivalents, and marketable securities balances, as well as borrowing available under our credit agreements, will be sufficient to meet our anticipated operating cash needs for at least the next 12 months. However, any projections of future cash needs and cash flows are subject to substantial uncertainty. See Item 1A of Part I, “Risk Factors.” We continually evaluate opportunities to sell additional equity or debt securities, obtain credit facilities, obtain capital, finance, and operating lease arrangements, repurchase common stock, pay dividends, or repurchase, refinance, or otherwise restructure our debt for strategic reasons or to further strengthen our financial position. \nThe sale of additional equity or convertible debt securities would likely be dilutive to our shareholders. In addition, we will, from time to time, consider the acquisition of, or investment in, complementary businesses, products, services, capital infrastructure, and technologies, which might affect our liquidity requirements or cause us to secure additional financing, or issue additional equity or debt securities. There can be no assurance that additional lines-of-credit or financing instruments will be available in amounts or on terms acceptable to us, if at all.\nBeginning in the first quarter of 2015, we changed our reportable segments to North America, International, and AWS. These segments reflect the way the Company evaluates its business performance and manages its operations. See Item 1 of Part 1,“Financial Statements—Note 11—Segment Information.” \nNet sales include product and service sales. Product sales represent revenue from the sale of products and related shipping fees and digital media content where we record revenue gross. Service sales represent third-party seller fees earned (including commissions) and related shipping fees, AWS sales, digital content subscriptions, advertising services, and our co-branded credit card agreements. Amazon Prime membership fees are allocated between product sales and service sales and amortized over the life of the membership according to the estimated delivery of services. Net sales information is as follows (in millions):\nYear-over-year Percentage Growth, excluding the effect of foreign exchange rates:\n, compared to the comparable prior year periods. Changes in foreign currency exchange rates impacted net sales by \n. For a discussion of the effect on sales growth of foreign exchange rates, see “Effect of Foreign Exchange Rates” below.\n, compared to the comparable prior year periods. The sales growth in each year primarily reflects increased unit sales, including sales by marketplace sellers. Increased unit sales were driven largely by our continued efforts to reduce prices for our customers, including from our shipping offers, sales in faster growing categories such as electronics and other general merchandise, increased in-stock inventory availability, and increased selection of product offerings. \n, compared to the comparable prior year periods. The sales growth in each year primarily reflects increased unit sales, including sales by marketplace sellers, offset by the unfavorable effect of foreign exchange rates. Changes in foreign currency exchange rates impacted International net sales by \n. Increased unit sales were driven largely by our continued efforts to reduce prices for our customers, including from our shipping offers, sales in faster growing categories such \nas electronics and other general merchandise, increased in-stock inventory availability, and increased selection of product offerings. \n, compared to the comparable prior year periods. The sales growth primarily reflects increased customer usage, partially offset by pricing changes. Pricing changes were driven largely by our continued efforts to reduce prices for our customers.\nSegment operating income (loss) is as follows (in millions):\nThe increase in North America segment operating income in absolute dollars in \n, compared to the comparable prior year periods, is primarily due to increased unit sales, including sales by marketplace sellers, partially offset by increased levels of operating expenses to expand our fulfillment capacity and spending on technology infrastructure. There was a favorable impact from foreign exchange rates of $30 million, $0, and $7 million for \nThe decrease in International segment operating loss in absolute dollars in \n, compared to the comparable prior year period, is primarily due to increased unit sales, including sales by marketplace sellers, partially offset by increased levels of operating expenses to expand our fulfillment capacity, spending on technology infrastructure and marketing efforts, and the unfavorable impact from foreign exchange rates. The unfavorable impact from foreign exchange rates was $278 million, $27 million, and $70 million for \n. The decrease in International segment operating income (loss) in absolute dollars in 2014, compared to the comparable prior year period, is primarily due to increased levels of operating expenses to expand our fulfillment capacity and spending on technology infrastructure and marketing efforts, partially offset by increased unit sales, including sales by marketplace sellers. \nThe increase in AWS segment operating income in absolute dollars in \n, compared to the comparable prior year period, is primarily due to increased customer usage and cost structure productivity, partially offset by pricing changes and increased spending on technology infrastructure, which was primarily driven by additional investments to support the business growth. The decrease in AWS segment operating income in absolute dollars in 2014, compared to the comparable prior year period, is primarily due to pricing changes and increased spending on technology infrastructure, which was primarily driven by increased usage. There was a favorable impact from foreign exchange rates of $264 million, $41 million, and $38 million for \nSupplemental information about outbound shipping results for our North America and International segments is as follows (in millions):\nExcludes amounts charged on shipping activities by third-party sellers where we do not provide the fulfillment service.\nIncludes a portion of amounts earned from Amazon Prime memberships.\nIncludes amounts earned from Fulfillment by Amazon programs related to shipping services.\nIncludes North America and International segment net sales.\nWe expect our cost of shipping to continue to increase to the extent our customers accept and use our shipping offers at an increasing rate, our product mix shifts to the electronics and other general merchandise category, we reduce shipping rates, we use more expensive shipping methods, and we offer additional services. We seek to mitigate costs of shipping over time in part through achieving higher sales volumes, optimizing placement of fulfillment centers, negotiating better terms with our suppliers, and achieving better operating efficiencies. We believe that offering low prices to our customers is fundamental to our future success, and one way we offer lower prices is through shipping offers.\nWe have aggregated our North America and International segments’ products and services into groups of similar products and services and provided the supplemental disclosure of net sales (in millions) below. We evaluate whether additional disclosure is appropriate when a product or service category begins to approach a significant level of net sales. For the periods presented, no individual product or service represented more than 10% of net sales.    \nYear-over-year Percentage Growth, excluding the effect of foreign exchange rates:\nIncludes sales from non-retail activities, such as certain advertising services and our co-branded credit card agreements.\nInformation about operating expenses with and without stock-based compensation is as follows (in millions):\nOperating expenses without stock-based compensation are non-GAAP financial measures. See “Non-GAAP Financial Measures” and Item 8 of Part II, “Financial Statements and Supplementary Data—Note 1—Description of Business and Accounting Policies—Stock-Based Compensation.”\nIn 2014, we recorded charges estimated at $170 million primarily related to Fire phone inventory valuation and supplier commitment costs, the majority of which was included in the North America segment. \nCost of sales primarily consists of the purchase price of consumer products, digital media content costs where we record revenue gross, including Prime Video and Prime Music, packaging supplies, sortation and delivery centers and related equipment costs, and inbound and outbound shipping costs, including where we are the transportation service provider. Shipping costs to receive products from our suppliers are included in our inventory and recognized as cost of sales upon sale of products to our customers.\n, compared to the comparable prior year periods, is primarily due to increased product and shipping costs resulting from increased sales. The increase in 2014 was also impacted by the expansion of digital offerings and Fire phone inventory valuation and supplier commitment costs.\nCosts to operate our AWS segment are primarily classified as “Technology and content” as we leverage a shared infrastructure that supports both our internal technology requirements and external sales to AWS customers.\nFulfillment costs primarily consist of those costs incurred in operating and staffing our North America and International fulfillment and customer service centers and payment processing costs. While AWS payment processing and related transaction costs are included in fulfillment, AWS costs are primarily classified as “Technology and content.” Fulfillment costs as a percentage of net sales may vary due to several factors, such as payment processing and related transaction costs, our level of productivity and accuracy, changes in volume, size, and weight of units received and fulfilled, timing of fulfillment capacity expansion, the extent we utilize fulfillment services provided by third parties, mix of products and services sold, and our ability to affect customer service contacts per unit by implementing improvements in our operations and enhancements to our customer self-service features. Additionally, because payment processing and fulfillment costs associated with seller transactions are based on the gross purchase price of underlying transactions, and payment processing and related transaction \nand fulfillment costs are higher as a percentage of sales versus our retail sales, sales by our sellers have higher fulfillment costs as a percent of net sales.\n, compared to the comparable prior year periods, is primarily due to variable costs corresponding with increased physical and digital product and service sales volume, inventory levels, and sales mix; costs from expanding fulfillment capacity; and payment processing and related transaction costs.\nWe seek to expand our fulfillment capacity to accommodate a greater selection and in-stock inventory levels and to meet anticipated shipment volumes from sales of our own products as well as sales by third parties for which we provide the fulfillment services. We regularly evaluate our facility requirements.\nWe direct customers to our websites primarily through a number of targeted online marketing channels, such as our Associates program, sponsored search, portal advertising, email marketing campaigns, direct sales, and other initiatives. Our marketing expenses are largely variable, based on growth in sales and changes in rates. To the extent there is increased or decreased competition for these traffic sources, or to the extent our mix of these channels shifts, we would expect to see a corresponding change in our marketing expense.\n, compared to the comparable prior year periods, is primarily due to increased spending on online marketing channels, as well as payroll and related expenses.\nWhile costs associated with Amazon Prime memberships and other shipping offers are not included in marketing expense, we view these offers as effective worldwide marketing tools, and intend to continue offering them indefinitely.\nTechnology costs consist principally of research and development activities including payroll and related expenses for employees involved in application, production, maintenance, operation, and platform development for new and existing products and services, as well as AWS and other technology infrastructure expenses. Content costs consist principally of payroll and related expenses for employees involved in category expansion, editorial content, buying, and merchandising selection. Digital media content costs related to revenue recorded gross, including Prime Video, are included in cost of sales.\nWe seek to invest efficiently in several areas of technology and content so we may continue to enhance the customer experience and improve our process efficiency through rapid technology developments while operating at an ever increasing scale. Our technology and content investment and capital spending projects often support a variety of product and service offerings due to geographic expansion and the cross-functionality of our systems and operations. We expect spending in technology and content to increase over time as we continue to add employees and technology infrastructure. The increase in technology and content costs in absolute dollars in \n, compared to comparable prior year periods, is primarily due to increased spending on technology infrastructure principally allocated to our AWS segment, and an increase in payroll and related costs associated with expanding our products and services.\nTechnology infrastructure costs consist of servers, networking equipment, and data center related depreciation, rent, utilities, and payroll expenses. These costs are allocated to segments based on usage. In \n, we expanded our technology infrastructure principally by increasing our capacity for AWS service offerings globally, compared to the comparable prior year periods. Additionally, the costs associated with operating and maintaining our expanded infrastructure have increased over time, corresponding with increased usage. We expect these trends to continue over time as we invest in technology infrastructure to support increased usage.\nThe increase in payroll and related costs is primarily due to the expansion of new and existing product categories and service offerings, including AWS, and initiatives to expand our ecosystem of products and services.\n of stock-based compensation) of costs associated with internal-use software and website development. Amortization of previously capitalized amounts was \n in general and administrative costs in absolute dollars in \n, compared to the comparable prior year period, is primarily due to increases in payroll and related expenses. The \n in general and administrative costs in absolute dollars in \n, compared to the comparable prior year period, is primarily due to increases in payroll and related expenses and professional service fees.\n, compared to the comparable prior year periods, is primarily due to an increase in the number of stock-based compensation awards granted to existing and new employees.\n, and was primarily related to the amortization of intangible assets.\nFor the reasons discussed above, income from operations \nWe believe that income from operations is a more meaningful measure than gross profit and gross margin due to the diversity of our product categories and services.\n. We generally invest our excess cash in investment grade short- to intermediate-term fixed income securities and AAA-rated money market funds. Our interest income corresponds with the average balance of invested funds based on the prevailing rates, which vary depending on the geographies and currencies in which they are invested.\n is primarily due to increases in our long-term debt, and capital and finance lease arrangements. \n. See Item 8 of Part II, “Financial Statements and Supplementary Data—Note 5—Long-Term Debt and Note 6—Other Long-Term Liabilities” for additional information.\n. The primary component of other income (expense), net is related to foreign-currency gains (losses).\nOur effective tax rate is subject to significant variation due to several factors, including variability in our pre-tax and taxable income and loss and the mix of jurisdictions to which they relate, changes in how we do business, acquisitions (including integrations) and investments, audit-related developments, foreign currency gains (losses), changes in law, regulations, and administrative practices, and relative changes of expenses or losses for which tax benefits are not recognized. Additionally, our effective tax rate can be more or less volatile based on the amount of pre-tax income or loss. For example, the impact of discrete items and non-deductible expenses on our effective tax rate is greater when our pre-tax income is lower. \n. Our provision for income taxes in 2015 was higher than in 2014 primarily due to an increase in U.S. pre-tax income and increased losses in certain foreign subsidiaries for which we may not realize a tax benefit. Losses for which we may not realize a related tax benefit, primarily due to losses of foreign subsidiaries, reduce our pre-tax income without a corresponding reduction in our tax expense, and therefore increase our effective tax rate. We have recorded valuation allowances against the deferred tax assets associated with losses for which we may not realize a related tax benefit. We generated income in lower tax jurisdictions primarily related to our European operations, which are headquartered in Luxembourg.\nOur provision for income taxes in 2014 was higher than in 2013 primarily due to the increased losses in certain foreign subsidiaries for which we may not realize a tax benefit and audit-related developments, partially offset by the favorable impact of earnings in lower tax rate jurisdictions. Losses for which we may not realize a related tax benefit were primarily generated by our foreign subsidiaries. Income earned in lower tax jurisdictions was primarily related to our European operations. \nWe have tax benefits relating to excess stock-based compensation deductions and accelerated depreciation deductions that are being utilized to reduce our U.S. taxable income. In December 2015, U.S. legislation was enacted that extended accelerated depreciation deductions on qualifying property through 2019 and made permanent the U.S. federal research and development credit. As of \n, our federal net operating loss carryforward was approximately \n of federal tax credits potentially available to offset future tax liabilities. Our federal tax credits are primarily related to the U.S. federal research and development credit, which was made permanent in 2015.\nSee Item 8 of Part II, “Financial Statements and Supplementary Data—Note 10—Income Taxes” for additional information.\nEquity-method investment activity, net of tax, was \n, and is primarily related to our investment in LivingSocial. The primary component of this activity during \n was our share of a gain recorded by LivingSocial related to the sale of its Korean operations. This gain was partially offset by operating losses incurred by LivingSocial during the period.\nThe effect on our income from operations from changes in foreign exchange rates versus the U.S. Dollar is as follows (in millions):\nRepresents the outcome that would have resulted had foreign exchange rates in the reported period been the same as those in effect in the comparable prior year period for operating results.\nRepresents the increase or decrease in reported amounts resulting from changes in foreign exchange rates from those in effect in the comparable prior year period for operating results.\nRegulation G, Conditions for Use of Non-GAAP Financial Measures, and other SEC regulations define and prescribe the conditions for use of certain non-GAAP financial information. Our measures of free cash flows, operating expenses with and without stock-based compensation, and the effect of foreign exchange rates on our consolidated statements of operations, meet the definition of non-GAAP financial measures.\nWe provide multiple measures of free cash flows because we believe these measures provide additional perspective on the impact of acquiring property and equipment with cash and through capital and finance leases.\nFree cash flow is cash flow from operations reduced by “Purchases of property and equipment, including internal-use software and website development, net” which is included in cash flow from investing activities. The following is a reconciliation of free cash flow to the most comparable GAAP cash flow measure, “Net cash provided by (used in) operating activities,” for \nNet cash provided by (used in) operating activities\nPurchases of property and equipment, including internal-use software and website development, net\nNet cash provided by (used in) investing activities\nNet cash provided by (used in) financing activities\nFree cash flow less lease principal repayments is free cash flow reduced by “Principal repayments of capital lease obligations,” and “Principal repayments of finance lease obligations,” which are included in cash flow from financing activities. Free cash flow less lease principal repayments approximates the actual payments of cash for our capital and finance leases. The following is a reconciliation of free cash flow less lease principal repayments to the most comparable GAAP cash flow measure, “Net cash provided by (used in) operating activities,” for \nNet cash provided by (used in) operating activities\nPurchases of property and equipment, including internal-use software and website development, net\nNet cash provided by (used in) investing activities\nNet cash provided by (used in) financing activities\nFree Cash Flow Less Finance Lease Principal Repayments and Assets Acquired Under Capital Leases\nFree cash flow less finance lease principal repayments and assets acquired under capital leases is free cash flow reduced by “Principal repayments of finance lease obligations,” which are included in cash flow from financing activities, and property and equipment acquired under capital leases. In this measure, property and equipment acquired under capital leases is reflected as if these assets had been purchased with cash, which is not the case as these assets have been leased. The following is a reconciliation of free cash flow less finance lease principal repayments and assets acquired under capital leases to the most comparable GAAP cash flow measure, “Net cash provided by (used in) operating activities,” for \nNet cash provided by (used in) operating activities\nPurchases of property and equipment, including internal-use software and website development, net\nProperty and equipment acquired under capital leases\nFree cash flow less finance lease principal repayments and assets acquired under capital leases\nNet cash provided by (used in) investing activities\nNet cash provided by (used in) financing activities\nAll of these free cash flows measures have limitations as they omit certain components of the overall cash flow statement and do not represent the residual cash flow available for discretionary expenditures. For example, these measures of free cash flows do not incorporate the portion of payments representing principal reductions of debt or cash payments for business acquisitions. Additionally, our mix of property and equipment acquisitions with cash or other financing options may change over time. Therefore, we believe it is important to view free cash flows measures only as a complement to our entire consolidated statements of cash flows.\nOperating Expenses, Excluding Stock-Based Compensation\nOperating expenses with and without stock-based compensation is provided to show the impact of stock-based compensation, which is non-cash and excluded from our internal operating plans and measurement of financial performance (although we consider the dilutive impact to our shareholders when awarding stock-based compensation and value such awards accordingly). In addition, unlike other centrally-incurred operating costs, stock-based compensation is not allocated to segment \nresults, and therefore, excluding it from operating expenses is consistent with our segment presentation in our footnotes to the consolidated financial statements.\nOperating expenses without stock-based compensation has limitations since it does not include all expenses primarily related to our workforce. More specifically, if we did not pay out a portion of our compensation in the form of stock-based compensation, our cash salary expense included in the “Fulfillment,” “Marketing,” “Technology and content,” and “General and administrative” line items would be higher.\nInformation regarding the effect of foreign exchange rates, versus the U.S. Dollar, on our consolidated statements of operations is provided to show reported period operating results had the foreign exchange rates remained the same as those in effect in the comparable prior year period.\n, in our earnings release furnished on Form 8-K as set forth below. These forward-looking statements reflect Amazon.com’s expectations as of \n, and are subject to substantial uncertainty. Our results are inherently unpredictable and may be materially affected by many factors, such as fluctuations in foreign exchange rates, changes in global economic conditions and customer spending, world events, the rate of growth of the Internet and online commerce, as well as those outlined in Item 1A of Part I, “Risk Factors.”\nNet sales are expected to be between $26.5 billion and $29.0 billion, or to grow between 17% and 28% compared with first quarter 2015.\nOperating income is expected to be between $100 million and $700 million, compared with $255 million in first quarter 2015.\nThis guidance includes approximately $600 million for stock-based compensation and other operating expense (income), net. It assumes, among other things, that no additional business acquisitions, investments, restructurings, or legal settlements are concluded and that there are no further revisions to stock-based compensation estimates.", "6": "The following selected consolidated financial data should be read in conjunction with the consolidated financial statements and the notes thereto in Item 8 of Part II, “Financial Statements and Supplementary Data,” and the information contained in Item 7 of Part II, “Management’s Discussion and Analysis of Financial Condition and Results of Operations.” Historical results are not necessarily indicative of future results.\nWeighted-average shares used in computation of earnings per share:\nNet cash provided by (used in) operating activities\nFor further discussion of earnings per share, see Item 8 of Part II, “Financial Statements and Supplementary Data—Note 1—Description of Business and Accounting Policies.”", "1B": "", "8": "Report of Ernst & Young LLP, Independent Registered Public Accounting Firm\nConsolidated Statements of Comprehensive Income (Loss)\nReport of Independent Registered Public Accounting Firm\nWe have audited the accompanying consolidated balance sheets of Amazon.com, Inc. as of \n, and the related consolidated statements of operations, comprehensive income (loss), stockholders’ equity, and cash flows for each of the three years in the period ended \n. These financial statements are the responsibility of the company’s management. Our responsibility is to express an opinion on these financial statements based on our audits.\nWe conducted our audits in accordance with the standards of the Public Company Accounting Oversight Board (United States). Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement. An audit includes examining, on a test basis, evidence supporting the amounts and disclosures in the financial statements. An audit also includes assessing the accounting principles used and significant estimates made by management, as well as evaluating the overall financial statement presentation. We believe that our audits provide a reasonable basis for our opinion.\nIn our opinion, the financial statements referred to above present fairly, in all material respects, the consolidated financial position of Amazon.com, Inc. at \n, and the consolidated results of its operations and its cash flows for each of the three years in the period ended \n, in conformity with U.S. generally accepted accounting principles. \nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States), Amazon.com, Inc.’s internal control over financial reporting as of \n, based on criteria established in Internal Control—Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) and our report dated \nAdjustments to reconcile net income (loss) to net cash from operating activities:\nDepreciation of property and equipment, including internal-use software and website development, and other amortization, including capitalized content costs\nLosses (gains) on sales of marketable securities, net\nNet cash provided by (used in) operating activities\nPurchases of property and equipment, including internal-use software and website development, net\nNet cash provided by (used in) investing activities\nNet cash provided by (used in) financing activities\nForeign-currency effect on cash and cash equivalents\nNet increase (decrease) in cash and cash equivalents\nCash paid for interest on capital and finance lease obligations\nProperty and equipment acquired under capital leases\nProperty and equipment acquired under build-to-suit leases\nSee accompanying notes to consolidated financial statements.\nWeighted-average shares used in computation of earnings per share:\n(1)    Includes stock-based compensation as follows:\nSee accompanying notes to consolidated financial statements.\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME (LOSS)\nForeign currency translation adjustments, net of tax of $10, $(3), and $(20)\nNet change in unrealized gains (losses) on available-for-sale securities:\nUnrealized gains (losses), net of tax of $(5), $1, and $3\nReclassification adjustment for losses (gains) included in “Other income (expense), net,” net of tax of $0, $(1), and $(1)\nNet unrealized gains (losses) on available-for-sale securities\nSee accompanying notes to consolidated financial statements.\nSee accompanying notes to consolidated financial statements.\nStock-based compensation and issuance of employee benefit plan stock\nStock-based compensation and issuance of employee benefit plan stock\nStock-based compensation and issuance of employee benefit plan stock\nSee accompanying notes to consolidated financial statements.\nNote 1—DESCRIPTION OF BUSINESS AND ACCOUNTING POLICIES\nAmazon.com opened its virtual doors on the World Wide Web in July 1995. We seek to be Earth’s most customer-centric company. In each of our segments, we serve our primary customer sets, consisting of consumers, sellers, developers, enterprises, and content creators. We serve consumers through our retail websites and focus on selection, price, and convenience. We also manufacture and sell electronic devices. We offer programs that enable sellers to sell their products on our websites and their own branded websites and to fulfill orders through us, and programs that allow authors, musicians, filmmakers, app developers, and others to publish and sell content. We serve developers and enterprises of all sizes through our AWS segment, which provides access to technology infrastructure that enables virtually any type of business. In addition, we provide services, such as advertising services and co-branded credit card agreements. \n segments: North America, International, and AWS. See “Note 11—Segment Information.” \nCertain prior period amounts have been reclassified to conform to the current period presentation, including recasting the segment financial information within “Note 11—Segment Information” as a result of changing our reportable segments to include an AWS segment. \nThe consolidated financial statements include the accounts of Amazon.com, Inc., its wholly-owned subsidiaries, and those entities in which we have a variable interest and of which we are the primary beneficiary, including certain entities in India and China (collectively, the “Company”). Intercompany balances and transactions between consolidated entities are eliminated.\nThe preparation of financial statements in conformity with GAAP requires estimates and assumptions that affect the reported amounts of assets and liabilities, revenues and expenses, and related disclosures of contingent liabilities in the consolidated financial statements and accompanying notes. Estimates are used for, but not limited to, determining the selling price of products and services in multiple element revenue arrangements and determining the amortization period of these elements, incentive discount offers, sales returns, vendor funding, stock-based compensation forfeiture rates, income taxes, valuation and impairment of investments, inventory valuation and inventory purchase commitments, collectability of receivables, valuation of acquired intangibles and goodwill, depreciable lives of property and equipment, internal-use software and website development costs, acquisition purchase price allocations, investments in equity interests, and contingencies. Actual results could differ materially from those estimates.\nBasic earnings per share is calculated using our weighted-average outstanding common shares. Diluted earnings per share is calculated using our weighted-average outstanding common shares including the dilutive effect of stock awards as determined under the treasury stock method. In periods when we have a net loss, stock awards are excluded from our calculation of earnings per share as their inclusion would have an antidilutive effect. In 2014, we excluded stock awards of \nThe following table shows the calculation of diluted shares (in millions):\nShares used in computation of basic earnings per share\nShares used in computation of diluted earnings per share\nWe recognize revenue from product sales or services rendered when the following four criteria are met: persuasive evidence of an arrangement exists, delivery has occurred or service has been rendered, the selling price is fixed or determinable, and collectability is reasonably assured. Revenue arrangements with multiple deliverables are divided into separate units and revenue is allocated using estimated selling prices if we do not have vendor-specific objective evidence or third-party evidence of the selling prices of the deliverables. We allocate the arrangement price to each of the elements based on the relative selling prices of each element. Estimated selling prices are management’s best estimates of the prices that we would charge our customers if we were to sell the standalone elements separately and include considerations of customer demand, prices charged by us and others for similar deliverables, and the price if largely based on the cost of producing the product or service. \nSales of our digital devices, including Kindle e-readers, Fire tablets, Fire TVs, and Echo, are considered arrangements with multiple deliverables, consisting of the device, undelivered software upgrades and/or undelivered non-software services such as cloud storage and free trial memberships to other services. The revenue allocated to the device, which is the substantial portion of the total sale price, and related costs are generally recognized upon delivery. Revenue related to undelivered software upgrades and/or undelivered non-software services is deferred and recognized generally on a straight-line basis over the estimated period the software upgrades and non-software services are expected to be provided for each of these devices. \nSales of Amazon Prime memberships are also considered arrangements with multiple deliverables, including shipping benefits, Prime Video, Prime Music, Prime Photos, and access to the Kindle Owners’ Lending Library. The revenue related to the deliverables is amortized over the life of the membership based on the estimated delivery of services. Amazon Prime membership fees are allocated between product sales and service sales. Costs to deliver Amazon Prime benefits are recognized as cost of sales as incurred. As we add more benefits to the Prime membership, we will update the method of determining the estimated selling prices of each element as well as the allocation of Prime membership fees. \nWe evaluate whether it is appropriate to record the gross amount of product sales and related costs or the net amount earned as commissions. Generally, when we are primarily obligated in a transaction, are subject to inventory risk, have latitude in establishing prices and selecting suppliers, or have several but not all of these indicators, revenue is recorded at the gross sale price. We generally record the net amounts as commissions earned if we are not primarily obligated and do not have latitude in establishing prices. Such amounts earned are determined using fixed fees, a percentage of seller revenues, per-unit activity fees, or some combination thereof.\nProduct sales represent revenue from the sale of products and related shipping fees and digital media content where we record revenue gross. Product sales and shipping revenues, net of promotional discounts, rebates, and return allowances, are recorded when the products are shipped and title passes to customers. Retail sales to customers are made pursuant to a sales contract that provides for transfer of both title and risk of loss upon our delivery to the carrier. Amazon’s electronic devices sold through retailers are recognized at the point of sale to consumers. \nService sales represent third-party seller fees earned (including commissions) and related shipping fees, AWS sales, digital content subscriptions, advertising services, and our co-branded credit card agreements. Service sales, net of promotional discounts and return allowances, are recognized when service has been rendered.\nReturn allowances, which reduce revenue, are estimated using historical experience. Allowance for returns was \n. Revenue from product sales and services rendered is recorded net of sales and consumption taxes. Additionally, we periodically provide incentive offers to our customers to encourage purchases. Such offers include current discount offers, such as percentage discounts off current purchases, inducement offers, such as offers for future discounts subject to a minimum current purchase, and other similar offers. Current discount offers, when accepted by our customers, are treated as a reduction to the purchase price of the related transaction, while inducement offers, when accepted by our customers, are treated as a reduction to purchase price based on estimated future redemption rates. Redemption rates are estimated using our historical experience for similar inducement offers. Current discount offers and inducement offers are presented as a net amount in “Total net sales.”\nCost of sales primarily consists of the purchase price of consumer products, digital media content costs where we record revenue gross, including Prime Video and Prime Music, packaging supplies, sortation and delivery centers and related equipment costs, and inbound and outbound shipping costs, including where we are the transportation service provider. Shipping costs to receive products from our suppliers are included in our inventory, and recognized as cost of sales upon sale of products to our customers. Payment processing and related transaction costs, including those associated with seller transactions, are classified in “Fulfillment” on our consolidated statements of operations.\nWe have agreements with our vendors to receive funds for advertising services, cooperative marketing efforts, promotions, and volume rebates. We generally consider amounts received from vendors to be a reduction of the prices we pay for their goods, including property and equipment, or services, and therefore record those amounts as a reduction of the cost of inventory, cost of services, or cost of property and equipment. Vendor rebates are typically dependent upon reaching minimum purchase thresholds. We evaluate the likelihood of reaching purchase thresholds using past experience and current year forecasts. When volume rebates can be reasonably estimated, we record a portion of the rebate as we make progress towards the purchase threshold. \nWhen we receive direct reimbursements for costs incurred by us in advertising the vendor’s product or service, the amount we receive is recorded as an offset to “Marketing” on our consolidated statements of operations.\nFulfillment costs primarily consist of those costs incurred in operating and staffing our North America and International segments’ fulfillment and customer service centers, including costs attributable to buying, receiving, inspecting, and warehousing inventories; picking, packaging, and preparing customer orders for shipment; payment processing and related transaction costs, including costs associated with our guarantee for certain seller transactions; responding to inquiries from customers; and supply chain management for our manufactured electronic devices. Fulfillment costs also include amounts paid to third parties that assist us in fulfillment and customer service operations.\nMarketing costs primarily consist of targeted online advertising, television advertising, public relations expenditures, and payroll and related expenses for personnel engaged in marketing and selling activities. We pay commissions to participants in our Associates program when their customer referrals result in product sales and classify such costs as “Marketing” on our consolidated statements of operations. We also participate in cooperative advertising arrangements with certain of our vendors, and other third parties.\nAdvertising and other promotional costs are expensed as incurred and were \n. Prepaid advertising costs were not significant as of \nTechnology costs consist principally of research and development activities including payroll and related expenses for employees involved in application, production, maintenance, operation, and platform development for new and existing products and services, as well as AWS and other technology infrastructure expenses.\nContent costs consist principally of payroll and related expenses for employees involved in category expansion, editorial content, buying, and merchandising selection.\nTechnology and content costs are expensed as incurred, except for certain costs relating to the development of internal-use software and website development, including software used to upgrade and enhance our websites and applications supporting our business, which are capitalized and amortized over \nGeneral and administrative expenses primarily consist of payroll and related expenses; facilities and equipment, such as depreciation expense and rent; professional fees and litigation costs; and other general corporate costs for corporate functions, including accounting, finance, tax, legal, and human resources, among others.\nCompensation cost for all stock awards expected to vest is measured at fair value on the date of grant and recognized over the service period. The fair value of restricted stock units is determined based on the number of shares granted and the quoted price of our common stock, and the fair value of stock options is estimated on the date of grant using a Black-Scholes model. Such value is recognized as expense over the service period, net of estimated forfeitures, using the accelerated method. The estimated number of stock awards that will ultimately vest requires judgment, and to the extent actual results or updated estimates differ from our current estimates, such amounts will be recorded as a cumulative adjustment in the period estimates are revised. We consider many factors when estimating expected forfeitures, including employee level, economic conditions, time remaining to vest, and historical forfeiture experience.\nOther operating expense (income), net, consists primarily of marketing-related, contract-based, and customer-related intangible asset amortization expense and expenses related to legal settlements.\nOther income (expense), net, consists primarily of foreign currency losses of \n, and realized gains (losses) on marketable securities sales of \nIncome tax expense includes U.S. (federal and state) and foreign income taxes. Except as required under U.S. tax laws, we do not provide for U.S. taxes on our undistributed earnings of foreign subsidiaries that have not been previously taxed since we intend to invest such undistributed earnings indefinitely outside of the U.S. If our intent changes or if these funds are needed for our U.S. operations, we would be required to accrue or pay U.S. taxes on some or all of these undistributed earnings and our effective tax rate would be adversely affected. Undistributed earnings of foreign subsidiaries that are indefinitely invested outside of the U.S were \n. Determination of the unrecognized deferred tax liability that would be incurred if such amounts were repatriated is not practicable.\nDeferred income tax balances reflect the effects of temporary differences between the carrying amounts of assets and liabilities and their tax bases and are stated at enacted tax rates expected to be in effect when taxes are actually paid or recovered.\nDeferred tax assets are evaluated for future realization and reduced by a valuation allowance to the extent we believe they will not be realized. We consider many factors when assessing the likelihood of future realization of our deferred tax assets, including our recent cumulative earnings experience and expectations of future taxable income and capital gains by taxing jurisdiction, the carry-forward periods available to us for tax reporting purposes, and other relevant factors. We allocate our valuation allowance to current and long-term deferred tax assets on a pro-rata basis.\nWe utilize a two-step approach to recognizing and measuring uncertain income tax positions (tax contingencies). The first step is to evaluate the tax position for recognition by determining if the weight of available evidence indicates it is more likely than not that the position will be sustained on audit, including resolution of related appeals or litigation processes. The second step is to measure the tax benefit as the largest amount which is more than 50% likely of being realized upon ultimate settlement. We consider many factors when evaluating our tax positions and estimating our tax benefits, which may require periodic adjustments and which may not accurately forecast actual outcomes. We include interest and penalties related to our tax contingencies in income tax expense.\nFair value is defined as the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. To increase the comparability of fair value measures, the following hierarchy prioritizes the inputs to valuation methodologies used to measure fair value:\n—Valuations based on quoted prices for identical assets and liabilities in active markets.\n—Valuations based on observable inputs other than quoted prices included in Level 1, such as quoted prices for similar assets and liabilities in active markets, quoted prices for identical or similar assets and liabilities in markets that are not active, or other inputs that are observable or can be corroborated by observable market data.\n—Valuations based on unobservable inputs reflecting our own assumptions, consistent with reasonably available assumptions made by other market participants. These valuations require significant judgment.\nFor our cash, cash equivalents, or marketable securities, we measure the fair value of money market funds and equity securities based on quoted prices in active markets for identical assets or liabilities. All other financial instruments were valued either based on recent trades of securities in inactive markets or based on quoted market prices of similar instruments and other significant inputs derived from or corroborated by observable market data. We did not hold any cash, cash equivalents, or marketable securities categorized as Level 3 assets as of \nAs part of entering into commercial agreements, we often obtain equity warrant assets giving us the right to acquire stock primarily in private companies. We record these assets in “Other assets” on the accompanying consolidated balance sheets. Equity warrant assets are classified as Level 3 assets, and the balances and related activity for our equity warrant assets were not significant for the periods ended \nWe classify all highly liquid instruments with an original maturity of three months or less as cash equivalents.\nInventories, consisting of products available for sale, are primarily accounted for using the first-in, first-out (“FIFO”) method, and are valued at the lower of cost or market value. This valuation requires us to make judgments, based on currently-available information, about the likely method of disposition, such as through sales to individual customers, returns to product vendors, or liquidations, and expected recoverable values of each disposition category. \nWe provide Fulfillment by Amazon services in connection with certain of our sellers’ programs. Third-party sellers maintain ownership of their inventory, regardless of whether fulfillment is provided by us or the third-party sellers, and therefore these products are not included in our inventories.\nWe also purchase electronic device components from a variety of suppliers and use several contract manufacturers to provide manufacturing services for our products. During the normal course of business, in order to manage manufacturing lead times and help ensure adequate component supply, we enter into agreements with contract manufacturers and suppliers. A portion of our reported purchase commitments arising from these agreements consists of firm, non-cancellable commitments. These commitments are based on forecasted customer demand. If we reduce these commitments, we may incur additional costs. \nIncluded in “Accounts receivable, net and other” on our consolidated balance sheets are amounts primarily related to customer and seller receivables and vendor receivables. As of \nWe estimate losses on receivables based on known troubled accounts and historical experience of losses incurred. Receivables are considered impaired and written-off when it is probable that all contractual payments due will not be collected in accordance with the terms of the agreement. The allowance for doubtful accounts was \nCosts incurred to develop software for internal use and our websites are capitalized and amortized over the estimated useful life of the software\n Costs related to design or maintenance of internal-use software and website development are expensed as incurred. For the years ended \n of stock-based compensation) of costs associated with internal-use software and website development. Amortization of previously capitalized amounts was \nProperty and equipment are stated at cost less accumulated depreciation. Property includes buildings and land that we own, along with property we have acquired under build-to-suit, financing, and capital lease arrangements. Equipment includes assets such as furniture and fixtures, heavy equipment, servers and networking equipment, and internal-use software and website development. \nDepreciation is recorded on a straight-line basis over the estimated useful lives of the assets\n or the remaining life of the underlying building, \n for heavy equipment). Depreciation expense is classified within the corresponding operating expense categories on our consolidated statements of operations.\nWe categorize leases at their inception as either operating or capital leases. On certain of our lease agreements, we may receive rent holidays and other incentives. We recognize lease costs on a straight-line basis without regard to deferred payment terms, such as rent holidays, that defer the commencement date of required payments. Additionally, incentives we receive are treated as a reduction of our costs over the term of the agreement. Leasehold improvements are capitalized at cost and amortized over the lesser of their expected useful life or the non-cancellable term of the lease.\nWe establish assets and liabilities for the estimated construction costs incurred under build-to-suit lease arrangements to the extent we are involved in the construction of structural improvements or take construction risk prior to commencement of a \nlease. Upon occupancy of facilities under build-to-suit leases, we assess whether these arrangements qualify for sales recognition under the sale-leaseback accounting guidance. If we continue to be the deemed owner, the facilities are accounted for as finance leases.\nWe establish assets and liabilities for the present value of estimated future costs to retire long-lived assets at the termination or expiration of a lease. Such assets are depreciated over the lease period into operating expense, and the recorded liabilities are accreted to the future value of the estimated retirement costs.\nWe evaluate goodwill for impairment annually or more frequently when an event occurs or circumstances change that indicate the carrying value may not be recoverable. In testing for goodwill impairment, we may elect to utilize a qualitative assessment to evaluate whether it is more likely than not that the fair value of a reporting unit is less than its carrying amount. If our qualitative assessment indicates that goodwill impairment is more likely than not, we perform a two-step impairment test. We test goodwill for impairment under the two-step impairment test by first comparing the book value of net assets to the fair value of the reporting units. If the fair value is determined to be less than the book value or qualitative factors indicate that it is more likely than not that goodwill is impaired, a second step is performed to compute the amount of impairment as the difference between the estimated fair value of goodwill and the carrying value. We estimate the fair value of the reporting units using discounted cash flows. Forecasts of future cash flows are based on our best estimate of future net sales and operating expenses, based primarily on expected category expansion, pricing, market segment share, and general economic conditions. \nwe changed the measurement date of our annual goodwill impairment test from October 1 to April 1\n. This change was not material to our consolidated financial statements as it did not result in the delay, acceleration, or avoidance of an impairment charge. \nWe believe this timing better aligns the goodwill impairment test with our strategic business planning process, which is a key component of the goodwill impairment test. \nWe completed the required annual testing of goodwill for impairment for all reporting units as of April 1, 2015, and determined that goodwill is not impaired. There were no triggering events identified from the date of our assessment through \n that would require an update to our annual impairment test. See “Note 4—Acquisitions, Goodwill, and Acquired Intangible Assets.”\nIncluded in “Other assets” on our consolidated balance sheets are amounts primarily related to acquired intangible assets, net of amortization; video and music content, net of amortization; long-term deferred tax assets; certain equity investments; marketable securities restricted for longer than one year, the majority of which are attributable to collateralization of bank guarantees and debt related to our international operations; intellectual property rights, net of amortization; and equity warrant assets.\nWe obtain video and music content to be made available to Prime members through licensing agreements that have a wide range of licensing provisions and generally have terms from \n years with fixed payment schedules. When the license fee for a specific movie, television, or music title is determinable or reasonably estimable and available for streaming, we recognize an asset representing the fee per title and a corresponding liability for the amounts owed. We relieve the liability as payments are made and we amortize the asset to “Cost of sales” on a straight-line basis or on an accelerated basis, based on estimated viewing patterns over each title’s contractual window of availability, which typically ranges from \n years. If we are unable to reasonably estimate the cost per title, no asset or liability is recorded and licensing costs are expensed as incurred. We also develop original content. The production costs of internally developed content are capitalized only if persuasive evidence exists that the production will generate revenue. Prior to 2015, because we had limited history to support the economic benefits of our content, we generally expensed such costs as incurred. In 2015, we began capitalizing a portion of production costs as we have developed more experience to support that future revenue will be earned. Capitalized internally developed costs are generally amortized to “Cost of sales” on an accelerated basis that follows the viewing pattern of customer streams in the first months after availability. \nWe generally invest our excess cash in investment grade short- to intermediate-term fixed income securities and AAA-rated money market funds. Such investments are included in “Cash and cash equivalents” or “Marketable securities” on the accompanying consolidated balance sheets, classified as available-for-sale, and reported at fair value with unrealized gains and losses included in “Accumulated other comprehensive loss.”\nEquity investments are accounted for using the equity method of accounting if the investment gives us the ability to exercise significant influence, but not control, over an investee. Equity-method investments are included within “Other assets” \non our consolidated balance sheets. Our share of the earnings or losses as reported by equity-method investees, amortization of basis differences, and related gains or losses, if any, are classified as “Equity\nmethod investment activity, net of tax” on our consolidated statements of operations. \nEquity investments without readily determinable fair values and for which we do not have the ability to exercise significant influence are accounted for using the cost method of accounting and classified as “Other assets” on our consolidated balance sheets. Under the cost method, investments are carried at cost and are adjusted only for other-than-temporary declines in fair value, certain distributions, and additional investments.\nEquity investments that have readily determinable fair values are classified as available-for-sale and are included in “Marketable securities” on our consolidated balance sheets and are recorded at fair value with unrealized gains and losses, net of tax, included in “Accumulated other comprehensive loss.”\nWe periodically evaluate whether declines in fair values of our investments below their book value are other-than-temporary. This evaluation consists of several qualitative and quantitative factors regarding the severity and duration of the unrealized loss as well as our ability and intent to hold the investment until a forecasted recovery occurs. Additionally, we assess whether we have plans to sell the security or it is more likely than not we will be required to sell any investment before recovery of its amortized cost basis. Factors considered include quoted market prices; recent financial results and operating trends; implied values from any recent transactions or offers of investee securities; credit quality of debt instrument issuers; other publicly available information that may affect the value of our investments; duration and severity of the decline in value; and our strategy and intentions for holding the investment.\nLong-lived assets, other than goodwill, are reviewed for impairment whenever events or changes in circumstances indicate that the carrying amount of the assets might not be recoverable. Conditions that would necessitate an impairment assessment include a significant decline in the observable market value of an asset, a significant change in the extent or manner in which an asset is used, or any other significant adverse change that would indicate that the carrying amount of an asset or group of assets may not be recoverable.\nFor long-lived assets used in operations, impairment losses are only recorded if the asset’s carrying amount is not recoverable through its undiscounted, probability-weighted future cash flows. We measure the impairment loss based on the difference between the carrying amount and estimated fair value. Long-lived assets are considered held for sale when certain criteria are met, including when management has committed to a plan to sell the asset, the asset is available for sale in its immediate condition, and the sale is probable within one year of the reporting date. Assets held for sale are reported at the lower of cost or fair value less costs to sell. Assets held for sale were not significant as of \nIncluded in “Accrued expenses and other” on our consolidated balance sheets are liabilities primarily related to unredeemed gift cards, leases and asset retirement obligations, current debt, acquired digital media content, and other operating expenses. \n. We reduce the liability for a gift card when redeemed by a customer. If a gift card is not redeemed, we recognize revenue when it expires or when the likelihood of its redemption becomes remote, generally \nUnearned revenue is recorded when payments are received in advance of performing our service obligations and is recognized over the service period. Unearned revenue primarily relates to prepayments of Amazon Prime memberships and AWS services. \nWe have internationally-focused websites for Australia, Brazil, Canada, China, France, Germany, India, Italy, Japan, Mexico, the Netherlands, Spain, and the United Kingdom\n Net sales generated from these websites, as well as most of the related expenses directly incurred from those operations, are denominated in local functional currencies. The functional currency of our subsidiaries that either operate or support these websites is generally the same as the local currency. Assets and liabilities of these subsidiaries are translated into U.S. Dollars at period-end foreign exchange rates, and revenues and expenses are translated at average rates prevailing throughout the period. Translation adjustments are included in “Accumulated other comprehensive loss,” a separate component of stockholders’ equity, and in the “Foreign-currency effect on cash and cash equivalents,” on our consolidated statements of cash flows. Transaction gains and losses including intercompany transactions denominated in a currency other than the functional currency of the entity involved are included in “Other income (expense), net” on our consolidated statements of operations. In connection with the settlement and remeasurement of intercompany balances, we recorded losses of \nIn May 2014, the Financial Accounting Standards Board (“FASB”) issued an Accounting Standards Update (“ASU”) amending revenue recognition guidance and requiring more detailed disclosures to enable users of financial statements to understand the nature, amount, timing, and uncertainty of revenue and cash flows arising from contracts with customers. In August 2015, the FASB deferred the effective date of the revenue recognition guidance to reporting periods beginning after December 15, 2017. Early adoption is permitted for reporting periods beginning after December 15, 2016. We are continuing to evaluate our method of adoption and the impact this ASU, and related amendments and interpretations, will have on our consolidated financial statements.\nIn July 2015, the FASB issued an ASU modifying the accounting for inventory. Under this ASU, the measurement principle for inventory will change from lower of cost or market value to lower of cost and net realizable value. The ASU defines net realizable value as the estimated selling price in the ordinary course of business, less reasonably predictable costs of completion, disposal, and transportation. The ASU is applicable to inventory that is accounted for under the first-in, first-out method and is effective for reporting periods after December 15, 2016, with early adoption permitted. We do not expect adoption to have a material impact on our consolidated financial statements.\nIn November 2015, the FASB issued an ASU amending the accounting for income taxes and requiring all deferred tax assets and liabilities to be classified as non-current on the consolidated balance sheet. The ASU is effective for reporting periods beginning after December 15, 2016, with early adoption permitted. The ASU may be adopted either prospectively or retrospectively. We are currently evaluating the method of adoption and expect this ASU will have an impact on our consolidated balance sheets as our current deferred tax assets were \nNote 2—CASH, CASH EQUIVALENTS, AND MARKETABLE SECURITIES\n, our cash, cash equivalents, and marketable securities primarily consisted of cash, U.S. and foreign government and agency securities, AAA-rated money market funds, and other investment grade securities. Cash equivalents and marketable securities are recorded at fair value. The following table summarizes, by major security type, our cash, cash equivalents, and marketable securities that are measured at fair value on a recurring basis and are categorized using the fair value hierarchy (in millions):\nLess: Restricted cash, cash equivalents, and marketable securities (1)\nTotal cash, cash equivalents, and marketable securities\nLess: Restricted cash, cash equivalents, and marketable securities (1)\nTotal cash, cash equivalents, and marketable securities\nWe are required to pledge or otherwise restrict a portion of our cash, cash equivalents, and marketable securities as collateral for standby and trade letters of credit, guarantees, debt, real estate leases, and amounts due to third-party sellers in certain jurisdictions. We classify cash, cash equivalents, and marketable securities with use restrictions of less than twelve months as “Accounts receivable, net and other” and of twelve months or longer as non-current “Other assets” on our consolidated balance sheets. See “Note 7—Commitments and Contingencies.”\nThe following table summarizes gross gains and gross losses realized on sales of available-for-sale marketable securities (in millions):\nThe following table summarizes the contractual maturities of our cash equivalents and marketable fixed-income securities as of \nActual maturities may differ from the contractual maturities because borrowers may have certain prepayment conditions.\nProperty and equipment, at cost, consisted of the following (in millions):\nExcludes the original cost and accumulated depreciation of fully-depreciated assets.\nDepreciation expense on property and equipment was \n, which includes amortization of property and equipment acquired under capital leases of \n. Accumulated depreciation associated with capital leases was \nWe capitalize construction in progress and record a corresponding long-term liability for build-to-suit lease agreements where we are considered the owner, for accounting purposes, during the construction period. For buildings under build-to-suit lease arrangements where we have taken occupancy, which do not qualify for sales recognition under the sale-leaseback accounting guidance, we determined that we continue to be the deemed owner of these buildings. This is principally due to our significant investment in tenant improvements. As a result, the buildings are being depreciated over the shorter of their useful lives or the related leases’ terms. Additionally, certain build-to-suit lease arrangements and finance leases provide purchase options. Upon occupancy, the long-term construction obligations are considered long-term finance lease obligations with amounts payable during the next 12 months recorded as “Accrued expenses and other.” Gross assets remaining under finance leases were \n. Accumulated depreciation associated with finance leases was \nNote 4—ACQUISITIONS, GOODWILL, AND ACQUIRED INTANGIBLE ASSETS\n, we acquired certain companies for an aggregate purchase price of \n. The primary reasons for these acquisitions, none of which was individually material to our consolidated financial statements, were to acquire technologies and know-how to enable Amazon to serve customers more effectively. \nAcquisition-related costs were expensed as incurred and not significant. The aggregate purchase price of these acquisitions was allocated as follows (in millions):\nAcquired intangible assets have estimated useful lives of between \n years, with a weighted-average amortization period of \nThe fair value of assumed stock options, estimated using the Black-Scholes model, and restricted stock units of \n will be expensed over the remaining service period. We determined the estimated fair value of identifiable intangible assets acquired primarily by using the income approach. These assets are included within “Other assets” on our consolidated balance sheets and are being amortized to operating expenses on a straight-line basis over their estimated useful lives.\nPro Forma Financial Information – 2015 Acquisition Activity (unaudited) \nThe acquired companies were consolidated into our financial statements starting on their respective acquisition dates. The aggregate net sales and operating income (loss) of the companies acquired was \n. The following financial information, which excludes certain acquired companies for which the pro forma impact is not meaningful, presents our results as if the acquisitions during \n, we acquired Twitch Interactive, Inc. (“Twitch”) for approximately \n in cash, as adjusted for the assumption of options and other items. During 2014, we acquired certain other companies for an aggregate purchase price of \n. We acquired Twitch because of its user community and the live streaming experience it provides. The primary reasons for our other 2014 acquisitions were to acquire technologies and know-how to enable Amazon to serve customers more effectively.\nAcquisition-related costs were expensed as incurred and not significant. The aggregate purchase price of these acquisitions was allocated as follows (in millions):\nAcquired intangible assets have estimated useful lives of between \n years, with a weighted-average amortization period of \n, estimated using the Black-Scholes model, will be expensed over the remaining service period. We determined the estimated fair value of identifiable intangible assets acquired primarily by using the income approach. These assets are included within “Other assets” on our consolidated balance sheets and are being amortized to operating expenses on a straight-line or accelerated basis over their estimated useful lives.\nPro forma results of operations have not been presented because the effects of these acquisitions, individually and in the aggregate, were not material to our consolidated results of operations.\nIn 2013, we acquired several companies in cash transactions for an aggregate purchase price of \n. The primary reasons for these acquisitions were to expand our customer base and sales channels and to obtain certain technologies to be used in product development. We determined the estimated fair value of identifiable intangible assets acquired primarily by using the income and cost approaches. These assets are included within “Other assets” on our consolidated balance sheets and are being amortized to operating expenses on a straight-line or accelerated basis over their estimated useful lives. Acquisition-related costs were expensed as incurred and were not significant.\nPro forma results of operations have not been presented because the effects of these acquisitions, individually and in the aggregate, were not material to our consolidated results of operations. \nThe goodwill of the acquired companies is generally not deductible for tax purposes and is primarily related to expected improvements in technology performance and functionality, as well as sales growth from future product and service offerings and new customers, together with certain intangible assets that do not qualify for separate recognition. The following summarizes our goodwill activity in \nPrimarily includes changes in foreign exchange rates.\nIn conjunction with the change in reportable segments, we reallocated goodwill on a relative fair value basis.\nAcquired intangible assets, included within “Other assets” on our consolidated balance sheets, consist of the following (in millions):\nExcludes the original cost and accumulated amortization of fully-amortized intangibles.\nIntangible assets have estimated useful lives of between \n. Expected future amortization expense of acquired intangible assets as of \n of unsecured senior notes as described in the table below (collectively, the “Notes”). As of \n. We also have other long-term debt with a carrying amount, including the current portion, of \n. The face value of our total long-term debt obligations is as follows (in millions):\nIssued in November 2012, effective interest rates of the 2017 and 2022 Notes were \nIssued in December 2014, effective interest rates of the 2019, 2021, 2024, 2034, and 2044 Notes were \n. We may redeem the Notes at any time in whole, or from time to time, in part at specified redemption prices. We are not subject to any financial covenants under the Notes. The proceeds from the Notes are used for general corporate purposes. The estimated fair value of the Notes was approximately \n, which is based on quoted prices for our publicly-traded debt as of those dates.\nThe other debt, including the current portion, had a weighted-average interest rate of \n. We used the net proceeds from the issuance of this debt primarily to fund certain international operations. The estimated fair value of the other long-term debt, which is based on Level 2 inputs, approximated its carrying value as of \n, future principal payments for our total debt were as follows (in millions):\n, we entered into an unsecured revolving credit facility (the “Credit Agreement”) with a syndicate of lenders that provides us with a borrowing capacity of up to \nmay be extended for up to three additional one-year terms if approved by the lenders\n. The initial interest rate applicable to outstanding balances under the Credit Agreement is the London interbank offered rate (“\n, under our current credit ratings. If our credit ratings are downgraded this rate could increase to as much as LIBOR plus \n borrowings outstanding under the Credit Agreement as of \nOur other long-term liabilities are summarized as follows (in millions):\nCertain of our equipment, primarily related to technology infrastructure, and buildings have been acquired under capital leases. Long-term capital lease obligations are as follows (in millions):\nWe continue to be the deemed owner after occupancy of certain facilities that were constructed as build-to-suit lease arrangements and previously reflected as “Construction liabilities.” As such, these arrangements are accounted for as finance leases. Long-term finance lease obligations are as follows (in millions):\nWe capitalize construction in progress and record a corresponding long-term liability for build-to-suit lease agreements where we are considered the owner during the construction period for accounting purposes. These liabilities primarily relate to our corporate buildings and fulfillment, sortation, delivery, and data centers. \nWe have recorded tax reserves for tax contingencies, inclusive of accrued interest and penalties, for U.S. and foreign income taxes. These contingencies primarily relate to transfer pricing, state income taxes, and research and development credits. See “Note 10—Income Taxes” for discussion of tax contingencies.\nWe have entered into non-cancellable operating, capital, and finance leases for equipment and office, fulfillment, sortation, delivery, data center, and renewable energy facilities. Rental expense under operating lease agreements was \nThe following summarizes our principal contractual commitments, excluding open orders for purchases that support normal operations, as of \nIncludes unconditional purchase obligations related to long-term agreements to acquire and license digital media content that are not reflected on the consolidated balance sheets. For those agreements with variable terms, we do not estimate the total obligation beyond any minimum quantities and/or pricing as of the reporting date. Purchase obligations associated with renewal provisions solely at the option of the content provider are included to the extent such commitments are fixed or a minimum amount is specified.\nIncludes the estimated timing and amounts of payments for rent and tenant improvements associated with build-to-suit lease arrangements that have not been placed in service and digital media content liabilities associated with long-term digital media content assets with initial terms greater than one year.\n of tax contingencies for which we cannot make a reasonably reliable estimate of the amount and period of payment, if any.\n of our cash, cash equivalents, and marketable securities, and certain property and equipment as collateral for standby and trade letters of credit, guarantees, debt relating to certain international operations, real estate leases, and amounts due to third-party sellers in certain jurisdictions.\n, no vendor accounted for 10% or more of our purchases. We generally do not have long-term contracts or arrangements with our vendors to guarantee the availability of merchandise, particular payment terms, or the extension of credit limits.\nThe Company is involved from time to time in claims, proceedings, and litigation, including the following:\nIn November 2007, an Austrian copyright collection society, Austro-Mechana, filed lawsuits against Amazon.com International Sales, Inc., Amazon EU S.à r.l., Amazon.de GmbH, Amazon.com GmbH, and Amazon Logistik in the Commercial Court of Vienna, Austria and in the District Court of Munich, Germany seeking to collect a tariff on blank digital media sold by our EU-based retail websites to customers located in Austria. In July 2008, the German court stayed the German case pending a final decision in the Austrian case. In July 2010, the Austrian court ruled in favor of Austro-Mechana and ordered us to report all sales of products to which the tariff potentially applies for a determination of damages. We contested Austro-Mechana’s claim and in September 2010 commenced an appeal in the Commercial Court of Vienna. We lost this appeal and in March 2011 commenced an appeal in the Supreme Court of Austria. In October 2011, the Austrian Supreme Court referred the case to the European Court of Justice (“ECJ”). In July 2013, the ECJ ruled that EU law does not preclude application of the tariff where certain conditions are met and directed the case back to the Austrian Supreme Court for further \nproceedings. In October 2013, the Austrian Supreme Court referred the case back to the Commercial Court of Vienna for further fact finding to determine whether the tariff on blank digital media meets the conditions set by the ECJ. In August 2015, the Commercial Court of Vienna ruled that the Austrian tariff regime does not meet the conditions the ECJ set and dismissed Austro-Mechana’s claims. In September 2015, Austro-Mechana appealed that judgment to the Higher Commercial Court of Vienna. In December 2015, the Higher Commercial Court of Vienna confirmed that the Austrian tariff regime does not meet the conditions the ECJ set and dismissed Austro-Mechana’s appeal. A number of additional actions have been filed making similar allegations. In December 2012, a German copyright collection society, Zentralstelle für private Überspielungsrechte (“ZPU”), filed a complaint against Amazon EU S.à r.l., Amazon Media EU S.à r.l., Amazon Services Europe S.à r.l., Amazon Payments Europe SCA, Amazon Europe Holding Technologies SCS, and Amazon Eurasia Holdings S.à r.l. in the District Court of Luxembourg seeking to collect a tariff on blank digital media sold by the Amazon.de retail website to customers located in Germany. In January 2013, a Belgian copyright collection society, AUVIBEL, filed a complaint against Amazon EU S.à r.l. in the Court of First Instance of Brussels, Belgium, seeking to collect a tariff on blank digital media sold by the Amazon.fr retail website to customers located in Belgium. In November 2013, the Belgian court ruled in favor of AUVIBEL and ordered us to report all sales of products to which the tariff potentially applies for a determination of damages. We dispute the allegations of wrongdoing and intend to defend ourselves vigorously in these matters.\nIn May 2009, Big Baboon, Inc. filed a complaint against Amazon.com, Inc. and Amazon Payments, Inc. for patent infringement in the United States District Court for the Central District of California. The complaint alleges, among other things, that our third-party selling and payments technology infringes patents owned by Big Baboon, Inc. purporting to cover an “Integrated Business-to-Business Web Commerce And Business Automation System” (U.S. Patent Nos. 6,115,690 and 6,343,275) and seeks injunctive relief, monetary damages, treble damages, costs, and attorneys’ fees. In February 2011, the court entered an order staying the lawsuit pending the outcome of the Patent and Trademark Office’s re-examination of the patent. We dispute the allegations of wrongdoing and intend to defend ourselves vigorously in this matter.\nIn June 2012, Hand Held Products, Inc., a subsidiary of Honeywell, filed a complaint against Amazon.com, Inc., AMZN Mobile, LLC, AmazonFresh, LLC, A9.com, Inc., A9 Innovations, LLC, and Quidsi, Inc. in the United States District Court for the District of Delaware. The complaint alleges, among other things, that the use of mobile barcode reader applications, including Amazon Mobile, Amazon Price Check, Flow, and AmazonFresh, infringes U.S. Patent No. 6,015,088, entitled “Decoding Of Real Time Video Imaging.” The complaint seeks an unspecified amount of damages, interest, and an injunction. We dispute the allegations of wrongdoing and intend to defend ourselves vigorously in this matter.\nIn July 2012, Norman Blagman filed a purported class-action complaint against Amazon.com, Inc. for copyright infringement in the United States District Court for the Southern District of New York. The complaint alleges, among other things, that Amazon.com, Inc. sells digital music in our Amazon MP3 Store obtained from defendant Orchard Enterprises and other unnamed “digital music aggregators” without obtaining mechanical licenses for the compositions embodied in that music. The complaint seeks certification as a class action, statutory damages, attorneys’ fees, and interest. We dispute the allegations of wrongdoing and intend to defend ourselves vigorously in this matter.\nIn November 2012, Lexington Luminance LLC filed a complaint against Amazon.com, Inc. and Amazon Digital Services, Inc. in the United States District Court for the District of Massachusetts. The complaint alleges, among other things, that certain light-emitting diodes in certain Kindle devices infringe U.S. Patent No. 6,936,851, entitled “Semiconductor Light-Emitting Device And Method For Manufacturing Same.” The complaint seeks an unspecified amount of damages and an injunction or, in the absence of an injunction, a compulsory ongoing royalty. In March 2014, the court invalidated the plaintiff’s patent and dismissed the case with prejudice, and the plaintiff appealed the judgment to the United States Court of Appeals for the Federal Circuit. In February 2015, the Federal Circuit reversed the judgment of the district court. We dispute the allegations of wrongdoing and intend to defend ourselves vigorously in this matter.\nBeginning in August 2013, a number of complaints were filed alleging, among other things, that Amazon.com, Inc. and several of its subsidiaries failed to compensate hourly workers for time spent waiting in security lines and otherwise violated federal and state wage and hour statutes and common law. In August 2013, Busk v. Integrity Staffing Solutions, Inc. and Amazon.com, Inc. was filed in the United States District Court for the District of Nevada, and Vance v. Amazon.com, Inc., Zappos.com Inc., another affiliate of Amazon.com, Inc., and Kelly Services, Inc. was filed in the United States District Court for the Western District of Kentucky. In September 2013, Allison v. Amazon.com, Inc. and Integrity Staffing Solutions, Inc. was filed in the United States District Court for the Western District of Washington, and Johnson v. Amazon.com, Inc. and an affiliate of Amazon.com, Inc. was filed in the United States District Court for the Western District of Kentucky. In October 2013, Davis v. Amazon.com, Inc., an affiliate of Amazon.com, Inc., and Integrity Staffing Solutions, Inc. was filed in the United States District Court for the Middle District of Tennessee. The plaintiffs variously purport to represent a nationwide class of certain current and former employees under the Fair Labor Standards Act and/or state-law-based subclasses for certain current and former employees in states including Arizona, California, Pennsylvania, South Carolina, Kentucky, Washington, and Nevada, and one complaint asserts nationwide breach of contract and unjust enrichment claims. The complaints seek an unspecified amount of damages, interest, injunctive relief, and attorneys’ fees. We have been named in several other similar cases. In December 2014, the Supreme Court ruled in Busk that time spent waiting for and undergoing security screening is not \ncompensable working time under the federal wage and hour statute. In February 2015, the courts in those actions alleging only federal law claims entered stipulated orders dismissing those actions without prejudice. We dispute any remaining allegations of wrongdoing and intend to defend ourselves vigorously in these matters.\nIn September 2013, Personalized Media Communications, LLC filed a complaint against Amazon.com, Inc. and Amazon Web Services, LLC in the United States District Court for the District of Delaware. The complaint alleges, among other things, that the use of certain Kindle devices, Kindle apps and/or Amazon.com, Inc.’s website to purchase and receive electronic media infringes \n U.S. Patents: Nos. 5,887,243, 7,801,304, 7,805,749, 7,940,931, 7,769,170, 7,864,956, 7,827,587, 8,046,791, and 7,883,252, all entitled “Signal Processing Apparatus And Methods.” The complaint also alleges, among other things, that CloudFront, S3, and EC2 web services infringe \n of those patents, Nos. 7,801,304, 7,864,956, and 7,827,587. The complaint seeks an unspecified amount of damages, interest, and injunctive relief. In August 2015, the court invalidated all asserted claims of all asserted patents and dismissed the case with prejudice. In September 2015, Personalized Media appealed that judgment to the United States Court of Appeals for the Federal Circuit. We dispute the allegations of wrongdoing and intend to defend ourselves vigorously in this matter.\nIn November 2013, Memory Integrity, LLC filed a complaint against Amazon.com, Inc. for patent infringement in the United States District Court for the District of Delaware. The complaint alleges, among other things, that certain Kindle devices infringe U.S. Patent No. 7,296,121, entitled “Reducing Probe Traffic In Multiprocessor Systems.” The complaint seeks an unspecified amount of damages, costs, expenses, and interest. In December 2014, the case was stayed pending resolution of review petitions filed with the United States Patent and Trademark Office. We dispute the allegations of wrongdoing and intend to defend ourselves vigorously in this matter.\nIn December 2013, Appistry, Inc. filed a complaint against Amazon.com, Inc. and Amazon Web Services, Inc. for patent infringement in the United States District Court for the Eastern District of Missouri. The complaint alleges, among other things, that Amazon’s Elastic Compute Cloud infringes U.S. Patent Nos. 8,200,746, entitled “System And Method For Territory-Based Processing Of Information,” and 8,341,209, entitled “System And Method For Processing Information Via Networked Computers Including Request Handlers, Process Handlers, And Task Handlers.” The complaint seeks injunctive relief, an unspecified amount of damages, treble damages, costs, and interest. In March 2015, the case was transferred to the United States District Court for the Western District of Washington. In July 2015, the court granted our motion for judgment on the pleadings and invalidated the patents-in-suit. In August 2015, the court entered judgment in our favor. In September 2015, the plaintiff appealed that judgment to the United States Court of Appeals for the Federal Circuit, and filed a new complaint against Amazon.com, Inc. and Amazon Web Services, Inc. in the United States District Court for the Western District of Washington. The 2015 complaint alleges, among other things, that Amazon’s Elastic Compute Cloud, Simple Workflow, and Herd infringe U.S. Patent Nos. 8,682,959, entitled “System And Method For Fault Tolerant Processing Of Information Via Networked Computers Including Request Handlers, Process Handlers, And Task Handlers,” and 9,049,267, entitled “System And Method For Processing Information Via Networked Computers Including Request Handlers, Process Handlers, And Task Handlers.” The 2015 complaint seeks injunctive relief, an unspecified amount of damages, treble damages, costs, and interest. We dispute the allegations of wrongdoing and intend to defend ourselves vigorously in these matters. \nIn March 2014, Kaavo, Inc. filed a complaint against Amazon.com, Inc. and Amazon Web Services, Inc. for patent infringement in the United States District Court for the District of Delaware. The complaint alleges, among other things, that Amazon Web Services’ Elastic Beanstalk and CloudFormation infringe U.S. Patent No. 8,271,974, entitled “Cloud Computing Lifecycle Management For N-Tier Applications.” The complaint seeks injunctive relief, an unspecified amount of damages, costs, and interest. In June 2015, the case was stayed pending resolution of a motion for judgment on the pleadings in a related case. In July 2015, Kaavo Inc. filed another complaint against Amazon.com, Inc. and Amazon Web Services, Inc. in the United States District Court for the District of Delaware. The 2015 complaint alleges, among other things, that CloudFormation infringes U.S. Patent No. 9,043,751, entitled “Methods And Devices For Managing A Cloud Computing Environment.” The 2015 complaint seeks injunctive relief, an unspecified amount of damages, enhanced damages, attorneys’ fees, costs, and interest. In January 2016, the 2015 case was stayed pending resolution of a motion for judgment on the pleadings. We dispute the allegations of wrongdoing and intend to defend ourselves vigorously in these matters.\nIn December 2014, Smartflash LLC and Smartflash Technologies Limited filed a complaint against Amazon.com, Inc., Amazon.com, LLC, AMZN Mobile, LLC, Amazon Web Services, Inc. and Audible, Inc. for patent infringement in the United States District Court for the Eastern District of Texas. The complaint alleges, among other things, that Amazon Appstore, Amazon Instant Video, Amazon Music, Audible Audiobooks, the Amazon Mobile Ad Network, certain Kindle and Fire devices, Kindle e-bookstore, Amazon’s proprietary Android operating system, and the servers involved in operating Amazon Appstore, Amazon Instant Video, Amazon Music, the Fire TV app, Audible Audiobooks, Cloud Drive, Cloud Player, Amazon Web Services, and Amazon Mobile Ad Network infringe \n related U.S. Patents: Nos. 7,334,720; 7,942,317; 8,033,458; 8,061,598; 8,118,221; 8,336,772; and 8,794,516, all entitled “Data Storage and Access Systems.” In May 2015, the case was stayed until further notice. The complaint seeks an unspecified amount of damages, an injunction, enhanced damages, attorneys’ fees, costs, and interest. We dispute the allegations of wrongdoing and intend to defend ourselves vigorously in this matter.\nIn March 2015, Zitovault, LLC filed a complaint against Amazon.com, Inc., Amazon.com, LLC, Amazon Web Services, Inc., and Amazon Web Services, LLC for patent infringement in the United States District Court for the Eastern District of Texas. The complaint alleges that Elastic Compute Cloud, Virtual Private Cloud, Elastic Load Balancing, Auto-Scaling, and Elastic Beanstalk infringe U.S. Patent No. 6,484,257, entitled “System and Method for Maintaining N Number of Simultaneous Cryptographic Sessions Using a Distributed Computing Environment.” The complaint seeks injunctive relief, an unspecified amount of damages, enhanced damages, attorneys’ fees, costs, and interest. In January 2016, the case was transferred to the United States District Court for the Western District of Washington. We dispute the allegations of wrongdoing and intend to defend ourselves vigorously in this matter.\nIn June 2015, the European Commission opened a proceeding against Amazon.com, Inc. and Amazon EU S.à r.l. to investigate whether provisions in Amazon’s contracts with European publishers violate European competition rules. We believe we comply with European competition rules and are cooperating with the Commission. \nIn November 2015, Eolas Technologies, Inc. filed a complaint against Amazon.com, Inc. in the United States District Court for the Eastern District of Texas. The complaint alleges, among other things, that the use of “interactive features” on www.amazon.com, including “search suggestions and search results,” infringes U.S. Patent No. 9,195,507, entitled “Distributed Hypermedia Method and System for Automatically Invoking External Application Providing Interaction and Display of Embedded Objects Within A Hypermedia Document.” The complaint seeks a judgment of infringement together with costs and attorneys’ fees. We dispute the allegations of wrongdoing and intend to defend ourselves vigorously in this matter.\nThe outcomes of our legal proceedings are inherently unpredictable, subject to significant uncertainties, and could be material to our operating results and cash flows for a particular period. In addition, for some matters for which a loss is probable or reasonably possible, an estimate of the amount of loss or range of losses is not possible and we may be unable to estimate the possible loss or range of losses that could potentially result from the application of non-monetary remedies.\n par value preferred stock. No preferred stock was outstanding for any period presented.\nCommon shares outstanding plus shares underlying outstanding stock awards totaled \n. These totals include all vested and unvested stock awards outstanding, including those awards we estimate will be forfeited.\nIn January 2010, our Board of Directors authorized the Company to repurchase up to \n of our common stock with no fixed expiration. We have \nEmployees vest in restricted stock unit awards and stock options over the corresponding service term, generally between \nStock options outstanding, which were primarily obtained through acquisitions, totaled \n. The compensation expense for stock options, the total intrinsic value for stock options outstanding, the amount of cash received from the exercise of stock options, and the related tax benefits were not material for \nThe following table summarizes our restricted stock unit activity (in millions):\nScheduled vesting for outstanding restricted stock units as of \n of net unrecognized compensation cost related to unvested stock-based compensation arrangements. This compensation is recognized on an accelerated basis with approximately half of the compensation expected to be expensed in the next twelve months, and has a weighted-average recognition period of \n, the fair value of restricted stock units that vested was \nAs matching contributions under our 401(k) savings plan, we granted \n. Shares granted as matching contributions under our 401(k) plan are included in outstanding common stock when issued, and recorded as stock-based compensation expense.   \n, common stock available for future issuance to employees is \nChanges in the composition of accumulated other comprehensive loss for \nAmounts included in accumulated other comprehensive loss are recorded net of their related income tax effects.\n. We have tax benefits relating to excess stock-based compensation deductions and accelerated depreciation deductions that are being utilized to reduce our U.S. taxable income. In December 2015, U.S. legislation was enacted that extended accelerated depreciation deductions on qualifying property through 2019 and made permanent the U.S. federal research and development credit. As such, cash taxes paid, net of refunds, were \nThe components of the provision for income taxes, net are as follows (in millions):\nU.S. and international components of income before income taxes are as follows (in millions):\nThe items accounting for differences between income taxes computed at the federal statutory rate and the provision recorded for income taxes are as follows (in millions):\nIncome taxes computed at the federal statutory rate\nOur provision for income taxes in 2015 was higher than in 2014 primarily due to an increase in U.S. pre-tax income and increased losses in certain foreign subsidiaries for which we may not realize a tax benefit. Losses for which we may not realize a related tax benefit, primarily due to losses of foreign subsidiaries, reduce our pre-tax income without a corresponding reduction in our tax expense, and therefore increase our effective tax rate. We have recorded valuation allowances against the deferred tax assets associated with losses for which we may not realize a related tax benefit. We generated income in lower tax jurisdictions primarily related to our European operations, which are headquartered in Luxembourg.\nOur provision for income taxes in 2014 was higher than in 2013 primarily due to the increased losses in certain foreign subsidiaries for which we may not realize a tax benefit and audit-related developments, partially offset by the favorable impact of earnings in lower tax rate jurisdictions. Losses for which we may not realize a related tax benefit were primarily generated by our foreign subsidiaries. Income earned in lower tax jurisdictions was primarily related to our European operations. \nExcept as required under U.S. tax laws, we do not provide for U.S. taxes on our undistributed earnings of foreign subsidiaries that have not been previously taxed since we intend to invest such undistributed earnings indefinitely outside of the U.S. If our intent changes or if these funds are needed for our U.S. operations, we would be required to accrue or pay U.S. taxes on some or all of these undistributed earnings and our effective tax rate would be adversely affected. Undistributed earnings of foreign subsidiaries that are indefinitely invested outside of the U.S were \n. Determination of the unrecognized deferred tax liability that would be incurred if such amounts were repatriated is not practicable.\nDeferred income tax assets and liabilities are as follows (in millions):\nNet deferred tax assets, net of valuation allowance\nDeferred tax assets related to net operating losses and tax credits are presented net of tax contingencies.\n, related to net operating losses that result from excess stock-based compensation and for which any benefit realized will be recorded to stockholders’ equity.\n, related to net operating losses that result from excess stock-based compensation and for which any benefit realized will be recorded to stockholders’ equity.\n, related to tax credits that result from excess stock-based compensation and for which any benefit realized will be recorded to stockholders’ equity.\nRelates primarily to deferred tax assets that would only be realizable upon the generation of net income in certain foreign taxing jurisdictions and future capital gains.\n, our federal, foreign, and state net operating loss carryforwards for income tax purposes were approximately \n. The federal and state net operating loss carryforwards are subject to limitations under Section 382 of the Internal Revenue Code and applicable state tax law. If not utilized, a portion of the federal, foreign, and state net operating loss carryforwards will begin to expire in \n, our tax credit carryforwards for income tax purposes were approximately \n. If not utilized, a portion of the tax credit carryforwards will begin to expire in \nThe Company’s consolidated balance sheets reflect deferred tax assets related to net operating losses and tax credit carryforwards excluding amounts resulting from excess stock-based compensation. Amounts related to excess stock-based compensation are accounted for as an increase to additional paid-in capital if and when realized through a reduction in income taxes payable.\nWe are subject to income taxes in the U.S. (federal and state) and numerous foreign jurisdictions. Significant judgment is required in evaluating our tax positions and determining our provision for income taxes. During the ordinary course of business, there are many transactions and calculations for which the ultimate tax determination is uncertain. We establish reserves for tax-related uncertainties based on estimates of whether, and the extent to which, additional taxes will be due. These reserves are established when we believe that certain positions might be challenged despite our belief that our tax return positions are fully supportable. We adjust these reserves in light of changing facts and circumstances, such as the outcome of tax audits. The provision for income taxes includes the impact of reserve provisions and changes to reserves that are considered appropriate.\nThe reconciliation of our tax contingencies is as follows (in millions):\n, if fully recognized, would decrease our effective tax rate.\n, we had accrued interest and penalties, net of federal income tax benefit, related to tax contingencies of \n. Interest and penalties, net of federal income tax benefit, recognized for the years ended \nWe are under examination, or may be subject to examination, by the Internal Revenue Service (“IRS”) for the calendar year 2005 and thereafter.\n These examinations may lead to ordinary course adjustments or proposed adjustments to our taxes or our net operating losses with respect to years under examination as well as subsequent periods. As previously disclosed, we have received Notices of Proposed Adjustment from the IRS for transactions undertaken in the 2005 and 2006 calendar years relating to transfer pricing with our foreign subsidiaries. The IRS is seeking to increase our U.S. taxable income by an amount that would result in additional federal tax of approximately \n, subject to interest. To date, we have not resolved this matter administratively and are currently contesting it in U.S. Tax Court. We continue to disagree with these IRS positions and intend to defend ourselves vigorously in this matter. In addition to the risk of additional tax for 2005 and 2006 transactions, if this litigation is adversely determined or if the IRS were to seek transfer pricing adjustments of a similar nature for transactions in subsequent years, we could be subject to significant additional tax liabilities. \nCertain of our subsidiaries are under examination or investigation or may be subject to examination or investigation by the French Tax Administration (“FTA”) for calendar year 2006 and thereafter.\n These examinations may lead to ordinary course adjustments or proposed adjustments to our taxes. In September 2012, we received proposed tax assessment notices for calendar years 2006 through 2010 relating to the allocation of income between foreign jurisdictions. In June 2015, we received final tax collection notices for these years assessing additional French tax of \n, including interest and penalties through September 2012. We disagree with the assessment and intend to contest it vigorously. We plan to pursue all available administrative remedies at the FTA, and if we are not able to resolve this matter with the FTA, we plan to pursue judicial remedies. In addition to the risk of additional tax for years 2006 through 2010, if this litigation is adversely determined or if the FTA were to seek adjustments of a similar nature for subsequent years, we could be subject to significant additional tax liabilities. \nIn addition, in October 2014, the European Commission opened a formal investigation to examine whether decisions by the tax authorities in Luxembourg with regard to the corporate income tax paid by certain of our subsidiaries comply with European Union rules on state aid.\n If this matter is adversely resolved, Luxembourg may be required to assess, and we may be required to pay, additional amounts with respect to current and prior periods and our taxes in the future could increase. \nWe are also subject to taxation in various states and other foreign jurisdictions including Canada, China, Germany, India, Japan, Luxembourg, and the United Kingdom.\n We are under, or may be subject to, audit or examination and additional assessments in respect of these particular jurisdictions for \nWe expect the total amount of tax contingencies will grow in \n. In addition, changes in state, federal, and foreign tax laws may increase our tax contingencies. The timing of the resolution of income tax examinations is highly uncertain, and the amounts ultimately paid, if any, upon resolution of the issues raised by the taxing authorities may differ from the amounts accrued. It is reasonably possible that within the next 12 months we will receive additional assessments by various tax authorities or possibly reach resolution of income tax examinations in one or more jurisdictions. These assessments or settlements may or may not result in changes to our contingencies related to positions on tax filings in years through \n. The actual amount of any change could vary significantly depending on the ultimate timing and nature of any settlements. We cannot currently provide an estimate of the range of possible outcomes.\nBeginning in the first quarter of 2015, we changed our reportable segments to North America, International, and AWS. These segments reflect the way the Company evaluates its business performance and manages its operations. \nWe allocate to segment results the operating expenses “Fulfillment,” “Marketing,” “Technology and content,” and “General and administrative” based on usage, which is generally reflected in the segment in which the costs are incurred. The majority of technology infrastructure costs are allocated to the AWS segment based on usage. The majority of the remaining non-infrastructure technology costs are incurred in the U.S. and are allocated to our North America segment. We exclude from our allocations the portions of these operating expense lines attributable to stock-based compensation. We do not allocate the line item “Other operating expense (income), net” to our segment operating results. There are no internal revenue transactions between our reportable segments.\nThe North America segment consists primarily of amounts earned from retail sales of consumer products (including from sellers) and subscriptions through North America-focused websites such as www.amazon.com, www.amazon.ca, and www.amazon.com.mx. This segment includes export sales from these websites.\nThe International segment consists primarily of amounts earned from retail sales of consumer products (including from sellers) and subscriptions through internationally-focused websites such as www.amazon.com.au, www.amazon.com.br, www.amazon.cn, www.amazon.fr, www.amazon.de, www.amazon.in, www.amazon.it, www.amazon.co.jp, www.amazon.nl, www.amazon.es, and www.amazon.co.uk. This segment includes export sales from these internationally-focused websites (including export sales from these sites to customers in the U.S., Mexico, and Canada), but excludes export sales from our North American websites.\nThe AWS segment consists of amounts earned from global sales of compute, storage, database, and other AWS service offerings for start-ups, enterprises, government agencies, and academic institutions.\nInformation on reportable segments and reconciliation to consolidated net income (loss) is as follows (in millions):\nExcludes stock-based compensation and “Other operating expense (income), net,” which are not allocated to segments.\nWe have aggregated our products and services into groups of similar products and services and provided the supplemental disclosure of net sales (in millions) below. We evaluate whether additional disclosure is appropriate when a product or service category begins to approach a significant level of net sales. For the periods presented, no individual product or service represented more than \nIncludes sales from non-retail activities, such as certain advertising services, and our co-branded credit card agreements.\nNet sales generated from our internationally-focused websites are denominated in local functional currencies. Revenues are translated at average rates prevailing throughout the period. Net sales attributed to countries that represent a significant portion of consolidated net sales are as follows (in millions):\nTotal segment assets exclude corporate assets, such as cash and cash equivalents, marketable securities, other long-term investments, corporate facilities, goodwill and other acquired intangible assets, capitalized internal-use software and website development costs, and tax assets. Technology infrastructure assets are allocated among the segments based on usage, with the majority allocated to the AWS segment. Total segment assets reconciled to consolidated amounts are as follows (in millions):\nNorth America and International segment assets primarily consist of inventory, accounts receivable, and property and equipment.\nAWS segment assets primarily consist of property and equipment and accounts receivable.\nProperty and equipment, net by segment is as follows (in millions):\nTotal property and equipment additions by segment are as follows (in millions):\nIncludes property and equipment added under capital leases of \nIncludes property and equipment added under capital leases of \n, and rest of world property and equipment, net was \n. Except for the U.S., property and equipment, net, in any single country was less than \nDepreciation expense, including amortization of capitalized internal-use software and website development costs and other corporate property and equipment depreciation expense, are allocated to all segments based on usage. Total depreciation expense, by segment, is as follows (in millions):\nThe following tables contain selected unaudited statement of operations information for each quarter of \n. The following information reflects all normal recurring adjustments necessary for a fair presentation of the information for the periods presented. The operating results for any